[
    {
        "Course Title": "The Advanced Asian Languages Minor",
        "Description": "\nThe Advanced Asian Languages Minor is designed for students who wish to gain a high\nlevel of proﬁciency in an Asian language.\n\nIn some cases, language courses taken abroad may be counted towards the minor with the\napproval of the director of undergraduate studies and pending departmental review. It is\nessential that students returning from abroad take the language placement exam as soon\nas possible. For more information about the review process, please contact the director of\nundergraduate studies. Study abroad credits cannot be counted towards the humanities\nportion of the minor.\n\nCourse List\nCourseTitle\nMinor Requirements (7 units)\nPrerequisites:\nFirst and second year language courses in area of focus (or equivalent)\nRequired Language Courses (5 units)\n3 courses in area of focus (Chinese, Hindi-Urdu, Japanese or Korean) at the third-year\nlevel\n2 courses in the same language at the fourth-year level\nRequired Humanities Courses (2 units)\n2 ASIAN_LC courses in area of focus (China, Japan, Korea, South Asia) chosen in\nconsultation with the director of undergraduate studies\n"
    },
    {
        "Course Title": "The African Studies Adjunct Major",
        "Description": "\nThe adjunct major is structured to serve two broad aims.\n\nFirst, students are exposed to the geographical and disciplinary breadth of African studies.\nTo that end, all students take 200-level core courses in African history, anthropology,\nliterature, and/or politics, as well as 7 elective courses chosen from an array of disciplines,\nincluding African studies, African American studies, anthropology, history, political\nscience, religious studies, and several language and literature departments.\n\nSecond, students engage in in-depth research or immersion practicums, the products of\nwhich they develop in a capstone senior research seminar. Practicums often involve a\ncentral research component, but other proposed practicums of acceptable quality, depth\n\n\nof immersion, etc., may be approved. Among the experiences that may satisfy this\nrequirement with appropriate content are study abroad in Africa, research connected to\nthe Program of African Studies, internships, and independent study and senior capstone\nprojects.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nAdjunct Major Requirements (11 units)\nCourse List\nCourseTitle\n3 core courses chosen from:\nAFST 276-0\nAfrican Literature in Translation\nANTHRO 255-0\nContemporary African Worlds\nHISTORY 255-1\nBackground to African Civilization and Culture: Origins to 17th C.\nHISTORY 255-2\nBackground to African Civilization and Culture: 16th-19th C.\nHISTORY 255-3\nAfrican History, 1800s-Present: Colonialism, Independence, and Beyond\nPOLI_SCI 359-0\nPolitics of Africa\nIf more than three are taken, additional courses from this list may count toward the next\ngroup.\n7 additional courses chosen from an approved list (available on the program website).\n1 senior seminar:\nAFST 395-0\nSenior Research Seminar\nThere is also a required research or immersion practicum experience (see below)\nThe 11 courses must be selected from at least three departments.\nAt least 3 courses must be at the 300 level.\nAll adjunct majors require completion of a stand-alone major as well.\n\n\nAt most 2 courses counted toward the African studies adjunct major may be\ndouble-counted toward another major.\n"
    },
    {
        "Course Title": "The African Studies Minor",
        "Description": "\nThe minor in African studies approaches the study of African societies, cultures, histories,\nand arts across disciplines in the humanities, social sciences, and professions. Students\nearning a bachelor’s degree in Weinberg College or another Northwestern school may\ncomplete the minor. In addition, under graduates in all disciplines are welcome to\nparticipate formally or informally in the program’s activities, which advance the training of\nAfrica specialists at Northwestern and promote awareness of Africa in a wider context.\n\nMinor Requirements (6 units)\nCourse List\nCourseTitle\nAt least 2 courses must be from the following sequence:\nHISTORY 255-1\nBackground to African Civilization and Culture: Origins to 17th C.\nHISTORY 255-2\nBackground to African Civilization and Culture: 16th-19th C.\nHISTORY 255-3\nAfrican History, 1800s-Present: Colonialism, Independence, and Beyond\n1 course must be:\nANTHRO 255-0\nContemporary African Worlds\n3 elective courses:\nAt least half of the work in a course taken through another department must have African\nstudies content. Selections must be approved by the program.\nStudents must have at least an overall B average in the 6 courses.\nOnly 1 course for the minor may be double-counted towards a major.\nStudents must declare the minor at least two terms before they intend to graduate. They\nare encouraged to meet regularly with program staff and the director of undergraduate\nstudies to monitor their progress."
    },
    {
        "Course Title": "The American Studies Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\n\n\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nProgram Courses (5 units)\nTo be taken during the ﬁrst year in the major:\nAMER_ST 301-1\n& AMER_ST 301-2"
    },
    {
        "Course Title": "The Seminar for Major",
        "Description": ""
    },
    {
        "Course Title": "The and Seminar for Major",
        "Description": "\nand Seminar for Majors\nTo be taken during senior year:\nAMER_ST 390-1\n& AMER_ST 390-2 Senior Project\nand Senior Project\nRelated Courses (10 units) 1\n1 approved course from African American Studies, Asian American Studies, Latina and\nLatino Studies, or the Center for Native American and Indigenous Research\n2 of the following, preferably 1 history and 1 English:\nHISTORY 210-1\nNorth America and the United States to 1865\nHISTORY 210-2\nHistory of the United States, Reconstruction to the Present\nENGLISH 270-1\nAmerican Literary Traditions (Puritans to Moby Dick)\nENGLISH 270-2\nAmerican Literary Traditions (Mid-19th Century to World War I)\n7 additional courses chosen with the program director 2,3\n1\nMust be at the 200 or 300 level.\n\n2\nTheme of courses should have strong U.S. dimension but also global or comparative\nimplications.\n\n3\nAt least 1 course must be relevant to the theme but not centered on the United States.\n\n\nHonors in American Studies\nIn senior year all majors participate in the senior project seminar (AMER_ST 390-1 &\nAMER_ST 390-2) and work on a thesis on a topic of their choice. Students meet weekly\nwith their project advisers, the seminar instructor, and fellow seniors to discuss their\nprojects and common concerns. Students whose senior theses and grades are judged to\nmeet program criteria are recommended to the college for graduation with honors. For"
    },
    {
        "Course Title": "The more information consult the program director and see Honors in the Major",
        "Description": "\n"
    },
    {
        "Course Title": "The Anthropology Major",
        "Description": "\nStudents complete a 13-course program (12 courses in anthropology and 1 in formal\nstudies) for a major in anthropology. At the 200 level, courses provide background in the\nfour major subﬁelds of anthropology. At the 300 level, students expand both the breadth\nand depth of their studies, examining the philosophical and historical roots of the\ndiscipline. A research class (ANTHRO 322-0 Introduction to Archaeology Research\nDesign & Methods, ANTHRO 361-0 Talk as Social Action, ANTHRO 386-0 Methods in\nHuman Biology Research, or ANTHRO 389-0 Ethnographic Methods and Analysis)\nprovides an opportunity to learn research skills and gain valuable analytical, critical\nthinking, and writing skills. ANTHRO 370-0 Anthropology in Historical Perspective\nprovides an overview of the history of the ﬁeld. Six additional 300-level courses include\nconcentration courses from a subﬁeld and from across the department.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nDepartment Courses (12 units)\n5 core courses:\nANTHRO 211-0\nCulture & Society\nANTHRO 213-0\nHuman Origins\nANTHRO 214-0\nArchaeology: Unearthing History\n\n\nANTHRO 215-0\nThe Study of Culture through Language\nANTHRO 370-0\nAnthropology in Historical Perspective\n1 research course selected from the following:\nANTHRO 322-0\nIntroduction to Archaeology Research Design & Methods\nANTHRO 361-0\nTalk as Social Action\nANTHRO 386-0\nMethods in Human Biology Research\nANTHRO 389-0\nEthnographic Methods and Analysis\n3 300-level courses selected from a subﬁeld:\nArchaeology\nBiological Anthropology\nCultural Anthropology\nHuman Biology\nLinguistic Anthropology\n3 additional 300-level courses selected from any concentration or research course 1\nRelated Course (1 unit)\n1 formal studies course 2,3,4\n1\nFor the joint Anthropology/MMSS major, MMSS 300-0 double-counts as a 300-level"
    },
    {
        "Course Title": "The for triple major limitations see MMSS Adjunct Major",
        "Description": "\n\n2\nFor the biological anthropology and human biology concentrations, the formal studies\ncourse must be fulﬁlled by STAT 202-0, STAT 210-0, PSYCH 201-0, ECON 281-0, SESP\n210-0, or equivalent.\n\n3\nFor the archaeology, cultural anthropology, and linguistic anthropology concentrations,\nstatistics or another formal studies course can fulﬁll this requirement; a course designated\nfor Distribution Area II and/or Foundational Discipline Empirical and Deductive\nReasoning (FD-EDR).\n\n4\n\n\nFor the joint Anthropology/MMSS major, MATH 385-0 counts as the formal methods\nrelated course requirement for anthropology.\n"
    },
    {
        "Course Title": "The Arabic Minor",
        "Description": "\nThe Minor in Arabic is designed for students who wish to gain a high level of proﬁciency in\nArabic to understand and interact with communities of different ethnicities and cultures\nin the Middle East and to embrace diversity, equity, and inclusion. The course work leading"
    },
    {
        "Course Title": "The to the Minor",
        "Description": "\nthat inform the pedagogical tasks employed in each class. The Minor in Arabic is available\nto all students with at least two years of Arabic studies or its equivalent.\n\nCourse List\nCourseTitle\nPrerequisite 1\nARABIC 121-3\nArabic II (or equivalent proﬁciency)\nMinor Requirements (6 units) 2\nThird-year level sequence; recommended starting sequence for non-heritage Arabic\nspeakers (see explanation below)\nARABIC 211-1\nArabic III\nARABIC 211-2\nArabic III\nARABIC 211-3\nArabic III\nContent-based language courses (see explanation below)\nARABIC 216-0\nLanguage and Culture\nARABIC 245-0\nCurrent Events in the Middle East: Arab Society through Online News Media\nARABIC 304-0\nTranslation in Practice: A Bridge to the Future\nARABIC 316-1\nReading Arabic Poetry\nARABIC 316-2\nReading Classical Arabic Texts\nARABIC 316-3\nReading Modern Arabic Prose\n\n\n1\nBeginner students start with the Arabic I sequence (ARABIC 111-1, ARABIC 111-2,\nARABIC 111-3) and continue to the Arabic II sequence (ARABIC 121-1, ARABIC 121-2,\nARABIC 121-3) as prerequisite to the minor.\n\n2\nAt least two of the 6 courses in Arabic must be at the 300-level. No more than 1 unit of\nARABIC 399-0 may be applied as a 300-level unit towards the minor.\n\nThird-year Level Language Sequence\nThe program offers a 3-course language sequence on the third-year level which is based\non work with a language textbook with carefully sequenced grammar and culture\nexercises. While not mandatory, we encourage our students to take this sequence ﬁrst.\nHowever, native or near native speakers of Arabic skip these and must select courses from\nthe content-based course list.\n\nContent-Based Language Courses\nThe program also offers content-based language courses on the 200-level and 300-level.\nIn content-based courses, the thematic content - topics that students ﬁnd interesting and\nrelevant - provides the materials (mostly authentic language documents) around which\nlistening, speaking, reading, and writing activities are created. Content-based courses are\nself-contained and do not need to be taken in a sequence.\n\nStudy Abroad Policy\nLanguage courses taken abroad may be counted towards the minor with the approval of\nthe MENA Languages Program. It is essential that students returning from abroad take\nthe Arabic language placement test as soon as possible so that they can be placed into the\nappropriate course. Only study abroad courses above the level of ARABIC 121-3 can be\ncounted towards the minor. The Arabic minor must be completed with at least 3 units of\ncoursework at Northwestern.\n"
    },
    {
        "Course Title": "The Architectural Engineering and Design Minor",
        "Description": "\nThe Minor in Architectural Engineering and Design trains students in the fundamental\nprinciples and practice of architectural and engineering design. Students completing this\nprogram will learn architectural conceptualization, programming, and design\nimplementation in conjunction with analysis of the engineering materials and systems\nused in the construction of buildings and other structures. A key element of the program\nis aesthetic skills, which will be honed through the creative iterations of design. Students\ncompleting this program will be uniquely prepared for advanced study in either\n\n\narchitecture or engineering, and regardless of their ultimate career track, will be prepared\nas leaders of the building design profession.\n\nCourse List\nCourseTitle\nMinor Requirements (8 units)\nArchitectural Seminar - 0 unit 1\nCIV_ENV 280-1\nArchitectural Engineering & Design Seminar I\nCIV_ENV 280-2\nArchitectural Engineering & Design Seminar II\nCIV_ENV 280-3\nArchitectural Engineering & Design Seminar III\nCore courses - 3 required units 2\nCIV_ENV 385-1\nArchitectural Engineering and Design 1: Fundamentals\nCIV_ENV 385-2\nArchitectural Engineering & Design 2: Intermediate\nCIV_ENV 385-3\nArchitectural Engineering & Design 3: Advanced Studio\nArchitecture History - 2 units 3\nCIV_ENV 220-0\nStructural Art (required)\nChoose 1 unit from the list of courses below\nART_HIST 232-0\nIntroduction to the History of Architecture: 1400 to Present\nART_HIST 370-1\nModern Architecture and Design\nART_HIST 370-2\nContemporary Architecture and Design\nART_HIST 378-0\nThe Global City\nDesign and Analysis Techniques - choose 3 units\nCIV_ENV 323-0\nStructural Steel Design\nCIV_ENV 325-0\nReinforced Concrete\nCIV_ENV 352-0\nFoundation Engineering\n\n\nCIV_ENV 353-0\nEnergy Geostructures & Geosystems\nCIV_ENV 368-0\nSustainability: The City\nCIV_ENV 386-0\nHigh Performance Architectural Design\nCIV_ENV 387-0\nDesign of Sustainable Urban Developments\nCIV_ENV 388-1\nBuilding Science I: Fundamentals for Sustainable Buildings\nCIV_ENV 388-2\nBuilding Science II: Application for Sustainable Buildings\nCIV_ENV 395-0\nSpecial Topics in Civil and Environmental Engrg (Indoor Air Quality or Building Enclosure\nDesign)"
    },
    {
        "Course Title": "The Additional Conditions for Awarding Minor",
        "Description": "\n\nCourse with grades lower than a \"C\" or taken P/N will not be acceptable for this minor."
    },
    {
        "Course Title": "The courses used to meet the AED Minor",
        "Description": "\nmust not be counted towards the 16 units of major program requirements.\nTo declare the AED minor, students should submit the minor declaration form in MAS\n(McCormick Advising System) no later than the end of their junior year.\n1\nThe AED seminar sequence spans the Fall, Winter, and Spring Quarters. It includes\nlectures from architects, engineers, and construction managers from renowned ﬁrms in\nthe Chicago area and beyond, focusing on the large topic of sustainability in the built\nenvironment. The AED seminar is intended to be taken sequentially. It is strongly\nsuggested to take the sequence in the senior year.\n\n2\nThe Design Studio courses are intended as a sequence and must be taken as such. It is\nstrongly suggested to attend the sequence in the junior year.\n\n3\nThe Architecture History courses can be attended starting from the Sophomore year.\n"
    },
    {
        "Course Title": "The Art History Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nDepartment Courses (12 units) 1\n2 200-level courses\n10 300-level courses including:\nART_HIST 391-0\nArt Historical Methods Seminar 2\nAt least 1 Art History 390 or 395 seminar:\nART_HIST 390-0\nUndergraduate Seminar\nor ART_HIST 395-0\nMuseums\nAt least 1 Art History course in each of the following three art historical periods: 1)\npre-1400 CE; 2) 1400 CE-1800 CE; and 3) post-1800 CE\nAt least 2 Art History courses in Non-Euro-American art 3\nStudio Course (1 unit)\n1 course in art making, design, or other arts course approved by the director of\nundergraduate studies\n1\nOne credit of Chicago Field Studies may be substituted for either a 200- or 300-level Art\nHistory course when the internship is conducted at an arts organization approved by the\ndirector of undergraduate studies. Students conducting honors may count one of the two\nrequired ART_HIST 399-0 courses towards the major.\n\n2\nUndergraduate methods seminar should ideally be taken in junior year, especially by\nstudents who want to write an honors thesis.\n\n3\nDeﬁned as art made outside Europe and the continental USA or by diasporic communities\nin those regions.\n\nHonors in Art History\n\n\nMajors with strong academic records and an interest in pursuing honors must submit an\napplication to write a senior honors thesis to the director of undergraduate studies by the\nend of junior year. The thesis is written in the senior year, and submitted for evaluation\nnear Spring break. Honors also requires:\n\nSuccessful completion of 2 independent study courses taken with the faculty thesis\nadvisor, usually in fall and winter terms of senior year (ART_HIST 399-0 Independent\nStudy)\nParticipation in the departmental senior thesis colloquium\nStudents whose theses and grades meet department criteria are recommended to the\ncollege for graduation with honors. For further information see the description of the\nhonors program on the art history department website, contact the director of\nundergraduate studies, and see Honors in the Major.\n"
    },
    {
        "Course Title": "The Art History Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (8 units) 1\n2 courses at the 200 level\n6 courses at the 300 level\n1\nAt least 1 300-level course must be focused on art made outside Europe and the\ncontinental USA or by diasporic communities in those regions. One credit of Chicago Field\nStudies may be substituted for either a 200- or 300-level Art History course when the\ninternship is conducted at an arts organization approved by the Art History Director of\nUndergraduate Studies.\n"
    },
    {
        "Course Title": "The Art Theory and Practice Major",
        "Description": "\nStudents majoring in art theory and practice plan a program of study with and subject to\nthe approval of a department adviser.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\n\nCourse List\nCourseTitle\nMajor Requirements (15 units)\n3 200-level courses\nART 210-0\nIntroduction to Drawing\nART 230-0\nIntroduction to Time Based Arts\nART 240-0\nIntroduction to Sculpture\n3 history and/or theory courses\nART 270-0\nContemporary Art Survey\nor ART_HIST 260-0\nIntroduction to Contemporary Art\nand any 2 of the following\nART 272-0\nCritical Methods for Contemporary Art\nor ART 372-0\nSeminar\nor ART 382-0\nStudio/Seminar\nART 260-0\nART 360-0\n7 additional courses in department\n4 must be studio courses\nART 372-0 Seminar, ART 382-0 Studio/Seminar, and ART 390-0 Studio may be taken more\nthan once and counted more than once if each course is a different topic.\nFirst-Year Seminars (including College Seminars and First-Year Writing Seminars) do not\ncount toward the major.\nHonors in Art Theory and Practice\nAll senior majors enroll in ART 360-0 Senior Critique and produce a ﬁnal exhibition or\nproject. The department’s honors committee reviews all ﬁnal projects, considering\ninnovation, creativity, scope and ambition, and realization and presentation. Students\nwhose projects and overall records meet department criteria are recommended to the\ncollege for graduation with departmental honors. For more information consult the"
    },
    {
        "Course Title": "The department adviser and see Honors in the Major",
        "Description": "\n\nStudio Practice (in junior year)\nSenior Critique (in senior year)\n\n"
    },
    {
        "Course Title": "The Art Theory and Practice Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (6 units)\n2 200-level courses\nPossible courses: ART 210-0, ART 220-0, ART 230-0, ART 240-0, ART 250-0\n1 history and/or theory course\nART 270-0\nContemporary Art Survey\nor ART 272-0\nCritical Methods for Contemporary Art\nor ART 260-0\nStudio Practice\n3 additional courses in the department at the 300-level\nPossible courses: ART 372-0, ART 382-0, ART 390-0\nART 372-0 Seminar, ART 382-0 Studio/Seminar, and ART 390-0 Studio may be taken more\nthan once and counted more than once if each course is a different topic.\nFirst-Year Seminars (including College Seminars and First-Year Writing Seminars) do not\ncount toward the minor.\n"
    },
    {
        "Course Title": "The Asian American Studies Major",
        "Description": "\nStudents majoring in Asian American studies must complete 14 courses and an immersion\nproject.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nProgram Courses (12 units)\n2 core courses chosen from:\nASIAN_AM 210-0\nIntroduction to Asian American Studies\n\n\nASIAN_AM 214-0\nIntroduction to Asian American History\nASIAN_AM 216-0\nGlobal Asians\nASIAN_AM 275-0\nIntroduction to Asian American Literature\n4 introductory electives 1\n6 advanced electives 2\nRelated Courses (2 units)\n2 Ethnic Studies courses in disciplines other than Asian American Studies that explicitly\nfocus on race and ethnicity in the United States. Contact DUS for course approval and\napplication toward your major requirement (it is not automatic). First-year seminar\ncourses (including College Seminars and First-Year Writing Seminars) do not count toward\nthe major.\n1\nAll 200-level program courses (ASIAN_AM) count toward this requirement, but a course\nmay not be counted toward both this requirement and the 2-course core.\n\n2\nAll 300-level program courses (ASIAN_AM) count toward this requirement.\n\nImmersion Project\nThe immersion project can either be: 1) an advanced research project proposed by the\nstudent; or 2) an in-depth community engagement project in the form of an internship or\nsubstantial volunteer work, and subsequent supervised reading and writing. Both require\nstudents to complete the Capstone Seminar before or during the senior year offered\nunder the course number ASIAN_AM 392-0 . Students may additionally enroll in one or\nmore independent study courses with their project adviser to complete research and\nwriting. Juniors wishing to take the Capstone Seminar to develop a research project may\nbe able repeat it for credit as seniors, with the expectation that they will further their\nwork on the immersion project.\n\nAll immersion projects must be approved in advance by the DUS or major adviser.\nNo more than 2 units of credit earned through the immersion project may count toward\nthe 14 units required for the major (note: this limit does not include ASIAN_AM 392-0).\nOptions for immersion projects are listed below. The ﬁrst three options require a faculty\nmentor drawn from full-time program faculty (including afﬁliated faculty).\nSenior thesis in Asian American Studies.\nIndependently proposed research project and paper.\n\n\nIndependently proposed internship at an Asian American community organization or\nother nonproﬁt whose work involves Asian American issues; must include a strong\nacademic component with a research paper.\nSESP 299-1 Civic Engagement Capstone Research, SESP 299-2 Certiﬁcate in Civic\nEngagement- Capstone Project related to Asian American communities and issues.\nStudy abroad courses on Asian diasporas with a research paper.\nChicago Field Studies in a ﬁeld related to Asian American Studies with a research paper.\nHonors in Asian American Studies\nTo qualify for honors, a student must demonstrate consistently high performance in the\nmajor and complete a major research project during the senior year, selecting a thesis\nadviser from among core and afﬁliated faculty. Students whose theses and grades meet\nprogram criteria are recommended to the college for graduation with honors. For more\ninformation see the director of undergraduate studies or program director. Also see\nHonors in the Major.\n"
    },
    {
        "Course Title": "The Asian American Studies Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (7 units) 1\n1 core course chosen from the following:\nASIAN_AM 210-0\nIntroduction to Asian American Studies\nASIAN_AM 214-0\nIntroduction to Asian American History\nor HISTORY 214-0\nAsian American History\nASIAN_AM 275-0\nIntroduction to Asian American Literature\nor ENGLISH 275-0\nIntroduction to Asian American Literature\n5 additional courses in Asian American Studies. 2\n1 Ethnic Studies course in a discipline other than Asian American Studies that explicitly\nfocuses on race and ethnicity in the United States. Contact DUS for course approval and\napplication toward your minor requirement (it is not automatic). First-year seminar\ncourses (including College Seminars and First-Year Writing Seminars) do not count toward\nthe minor.\n1\nAt least 3 of the 7 courses must be at the 300 level.\n\n\n2\nUp to 2 courses from other units with signiﬁcant coverage of Asian American issues may\ncount toward the 5 courses with permission of the DUS.\n"
    },
    {
        "Course Title": "The Asian Humanities Minor",
        "Description": "\nThe Asian Humanities Minor is designed for students who do not require or are unable to\npursue extensive language training, but who still wish to make a serous commitment to\nthe study of Asian cultures. Students may choose, in consultation with the director of\nundergraduate studies, either a geographic area of focus (China, Japan, Korea, South Asia,\nor Comparative) or a thematic concentration (literary studies, ﬁlm, media, etc.) to provide\nfocus and depth to their course of study.\n\nIn some cases, up to two courses taken abroad may be counted towards the minor with\nthe approval of the director of undergraduate studies and pending departmental review.\nFor more information about the review process, please contact the director of\nundergraduate studies.\n\nCourse List\nCourseTitle\nMinor Requirements (7 units)\nPrerequisites:\nNone\nRequired Humanities Courses (7 units)\n7 ASIAN_LC courses chosen in consultation with the director of undergraduate studies\nAt least 3 must be at the 300-level\nAt most 2 may be relevant courses from outside the department selected from the list of\npre-approved courses or in consultation with the director of undergraduates studies\n"
    },
    {
        "Course Title": "The Asian Languages and Cultures Major",
        "Description": "\nThe Asian Languages and Cultures major is designed for students who wish to combine\nproﬁciency in an Asian language or languages (Chinese, Hindi-Urdu, Japanese, Korean)\nwith rigorous training in the study of an Asian culture or cultures (China, Japan, Korean,\nSouth Asia, or Comparative). In addition to developing the four core linguistic skills\n(speaking, listening, reading, and writing), students will acquire the cultural literacy\nnecessary for effective communication and sophisticated understanding of at least one\ncultural sphere or region of Asia. The humanities component of the major is designed to\n\n\nintroduce students to advanced methods of critical reading, viewing, interpretation, and\nacademic writing through training in literary studies, ﬁlm and media studies, gender\nstudies, and cultural studies, among other approaches. While most Asian Languages and\nCultures majors focus on one Asian language and area of focus, the major is also designed\nto accommodate students who wish to work comparatively within or between regions.\nFor example, students may combine the study of Korean and Japanese language and\nculture or explore colonial and post-colonial experiences in East and South Asia. Students\ninterested in pursuing a comparative focus will work closely with the director of\nundergraduate studies to develop a coherent course of study.\n\nStudents may apply for (but are not guaranteed) language credit towards the major for\ncourses taken while studying abroad (placement testing upon return is required). Pending\ndepartmental review of relevant course materials and the approval of the director of\nundergraduate studies, up to 2 humanities courses taken while studying abroad may also\nbe counted toward the major. For more information about the review process, please\ncontact the director of undergraduate studies.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nMajor Requirements (15 units)\nPrerequisites:\nFor students focusing on a single language/area, a ﬁrst year language course or equivalent\nproﬁciency is required. For students working comparatively, there are no prerequisites.\nRequired Language Courses (6 units):\n3 courses in Chinese, Hindi-Urdu, Japanese or Korean at the second-year level\n3 courses in the same language at the third-year level OR 3 courses in an additional Asian\nlanguage at the ﬁrst-year level or higher\nHumanities Courses (9 units): 200- and 300-level ASIAN_LC courses\n6 ASIAN_LC courses selected in consultation with the director of undergraduate studies\nto represent an area of focus (China, Japan, Korea, South Asia or comparative), of which:\nAt least 3 must be at the 300-level\n\n\nAt most 2 may be relevant courses from outside the department selected from the list of\npre-approved courses or in consultation with the director of undergraduate studies\n2 ASIAN_LC courses from outside the area of focus, selected in consultation with the\ndirector of undergraduate studies\n1 Senior Seminar (ASIAN_LC 397-0)\nHonors in Asian Languages and Cultures\nMajors with a strong academic record (a GPA of 3.5 both in the major and overall) and\ninterest in writing an honors thesis are encouraged to contact the director of\nundergraduate studies in the spring of their junior year. Students who are approved to\nwrite an honors thesis must take two quarters of ASIAN_LC 399-0 Independent Study in\naddition to the 15 courses required for the major. For more information, please contact\nthe director of undergraduate studies, review the department's website, and see Honors\nin the Major.\n"
    },
    {
        "Course Title": "The Biological Sciences Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nProgram Courses (10.02 units)\n7 core courses (5.02 units):\nBIOL_SCI 201-0\nBIOL_SCI 202-0\nBIOL_SCI 203-0\nBIOL_SCI 232-0\nBIOL_SCI 233-0\nBIOL_SCI 234-0\nBIOL_SCI 301-0\n2 300-level BIOL SCI Electives 1\n3 courses from one of the concentration areas:\nMolecular Genetics and Genomics\nCell and Developmental Biology\n\nMolecular Biology\nCell Biology\nGenetics and Evolution\nMolecular and Cellular Processes Laboratory\nGenetics and Molecular Processes Laboratory\nInvestigative Laboratory\nPrinciples of Biochemistry\n\n\nGeneral Chemistry I\n\nAdvanced General Inorganic Chemistry\n\nQuantitative Problem Solving in Chemistry\n\nHuman Health and Disease\nEcology, Evolution, and Conservation Biology\nBiochemistry and Biophysics\nComputational and Systems Biology 2\nMolecular Neurobiology\nInterdisciplinary Biology\nRelated Courses 3\nCHEM 110-0\n& CHEM 131-0\n& CHEM 132-0\nand Fundamentals of Chemistry I\nand Fundamentals of Chemistry II\nor CHEM 151-0\n& CHEM 152-0\nand General Chemistry II\nor CHEM 171-0\n& CHEM 172-0\nand Advanced General Physical Chemistry\nCHEM 215-1\n& CHEM 215-2\nand Organic Chemistry II\nor CHEM 217-1\n& CHEM 217-2\nand Accelerated Organic Chemistry II\nMATH 218-3 Single-Variable Calculus with Precalculus\nor MATH 220-2\n1 statistics course - BIOL_SCI 337-0 or STAT 202-0 or other approved course 4\nPHYSICS 130-1\n& PHYSICS 130-2 College Physics\nand College Physics\nor PHYSICS 135-1\n& PHYSICS 135-2 General Physics\nand General Physics\nor PHYSICS 140-1\n& PHYSICS 140-2\nand Fundamentals of Physics\n1\nBIOL_SCI 398-0 Tutorial in Biology and BIOL_SCI 399-0 Independent Research do not\ncount as 300-level BIOL SCI Electives. Students doing the Computational and Systems\n\nAccelerated Organic Chemistry I\n\nSingle-Variable Integral Calculus\n\nFundamentals of Physics\n\nOrganic Chemistry I\n\n\nBiology concentration and taking a 1.0 unit course to satisfy the coding requirement may\nuse this in place of one of the required 300-level electives.\n\n2\nThis concentration also has a programming competency requirement.\n\n3\nNumber of related course units depend on chemistry and mathematics sequences taken.\nLaboratory components of general and organic chemistry courses and physics courses\nrequire separate registration and bear separate credit. See chemistry and physics pages of\nthis Catalog for more information.\n\n4\nBIOL_SCI 337-0 Biostatistics may fulﬁll both a concentration or elective requirement and\nthe related course requirement in statistics.\n"
    },
    {
        "Course Title": "The Biological Sciences Second Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nThe Integrated Science Program is a highly selective BA program in Weinberg College (see\nIntegrated Science Program). Students majoring in ISP who wish to complete a second\nmajor in biological sciences should fulﬁll the following requirements. For concentration"
    },
    {
        "Course Title": "The alone Biological Sciences Major",
        "Description": "\nthat if an ISP student is pursuing both a Biological Sciences and a Chemistry second major,\nit is allowable to co-count CHEM 217-2 Accelerated Organic Chemistry II toward both.\n\nCourse List\nCourseTitle\nRequired courses:\nCHEM 217-2 Accelerated Organic Chemistry II\nThree courses for the chosen concentration in biological sciences\nHonors in Biological Sciences\n\n\nSeniors may be recommended to the college for graduation with honors if they have\ncompleted BIOL_SCI 397-0 Senior Thesis Colloquium and at least one quarter of\nBIOL_SCI 398-0 Tutorial in Biology or BIOL_SCI 399-0 Independent Research, have\nwritten an approved honors thesis based on their independent study, and have sufﬁciently\nhigh grades.\n\nMajors with strong academic records and an interest in pursuing honors must complete\nBIOL_SCI 397-0 Senior Thesis Colloquium in Winter Quarter of Senior Year.\n\nFor more information consult the biological sciences website and see the Honors in the\nMajor.\n"
    },
    {
        "Course Title": "The Black Studies Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nIntroduction to African-American Studies\n\nCourse List\nCourseTitle\nDepartment Courses (12 units)\n1 core course:\nBLK_ST 236-0\n10 elective courses in the department, including at least 6 at the 300 level\n1 senior course chosen from:\nBLK_ST 390-0\nBLK_ST 396-0\nBLK_ST 399-0\nHonors in Black Studies\nMajors with strong academic records and an interest in pursuing honors must notify the\ndirector of undergraduate studies during fall of senior year. To qualify for honors, a\nstudent must complete a substantial senior-year research project. With the director, the\nstudent selects a thesis adviser, who need not be a member of the department.\nCompletion of the thesis ordinarily requires at least two quarters of research and writing.\n\nResearch Seminar\nInternship in African-American Studies\nIndependent Study\n\n\nDuring one or both of those quarters students may register for BLK_ST 399-0\nIndependent Study with the thesis adviser. This course counts as either 1 of the 6 required\n“elective courses” in the major or as the senior-course requirement.\n\nStudents whose theses and grades meet department criteria are recommended to the\ncollege for graduation with honors. For more information contact the director of"
    },
    {
        "Course Title": "The undergraduate studies and see Honors in the Major",
        "Description": "\n"
    },
    {
        "Course Title": "The Black Studies Minor",
        "Description": "\nThe minor in Black Studies provides thorough exposure to contemporary scholarship\nconcerning the black experience.\n\nMinor Requirements\nCourse List\nCourseTitle\nMinor Courses (8 units)\n1 core course:\nBLK_ST 236-0\nIntroduction to African-American Studies\n7 elective courses in the department, at least 4 at the 300 level\n"
    },
    {
        "Course Title": "The Business German Minor",
        "Description": "\nThe Department of German offers minors in German, German studies, and Business\nGerman. Each minor consists of 8 courses. The minors are designed to help students\ndevelop a coherent set of courses in accordance with their own interests in German\nlanguage, literature, thought, culture, politics, and business practices.\n\nPrerequisite: GERMAN 102-3 Intermediate German or equivalent proﬁciency\n3 German-language courses in language, literature, and culture, from list posted on the\ndepartment website\n2 at the 200 level\n1 at the 300 level\n3 courses in business German:\nGERMAN 209-0 German in the Business World or GERMAN 213-0 History, Politics, and\nCulture in 21st Century German\nGERMAN 309-1 The German Market and the Globalized Economy\nGERMAN 309-2 Germany, Inc.: Marketing and Corporate Social Responsibility\n2 courses making up an individual concentration developed with the undergraduate\nadviser; may be taught in English\n\n\nMinors returning from a study abroad program must enroll in at least 1 300-level\nGerman-language course in the department.\n"
    },
    {
        "Course Title": "The Business Institutions Minor",
        "Description": "\nThe minor in business institutions requires the successful completion with a grade of C– or\nabove of 11 courses:\n\n4 prerequisite courses in mathematics, statistics, and economics\n4 business tools courses\n1 writing and speaking course\n2 social sciences and humanities electives\nBefore declaring the minor students must complete the 4 prerequisite courses with a\ngrade of C- or higher, or have equivalent AP course credit posted to their academic record.\n\nSee more details about the minor. Interested students should consult a program adviser or\nvisit the program ofﬁce for additional information.\n\nSingle-Variable Differential Calculus\n\nRequirements for the minor in Business Institutions\nCourse List\nCourseTitle\nPrerequisites (4 units)\nECON 201-0 Introduction to Macroeconomics\nECON 202-0 Introduction to Microeconomics\nSTAT 210-0 Introduction to Probability and Statistics (or equivalent) 1\nMATH 218-1 Single-Variable Calculus with Precalculus\nor MATH 220-1\nMinor Requirements (7 units) 2\n4 business tools courses: 3\nBUS_INST 301-0\nAccounting\nBUS_INST 302-0\nMarketing Management\nBUS_INST 303-0\nLeadership in Organizations\nBUS_INST 304-0\nCorporate Finance (or equivalent) 4\n1 writing and speaking in business course: 5\nENGLISH 282-0\nWriting and Speaking in Business\n\n\n2 social sciences and humanities electives that have business institutions and practices as\na central focus of inquiry, chosen from the list below. See the program website for newly\napproved courses and other updates.\n1\nEquivalents include BMD_ENG 220-0 Introduction to Biomedical Statistics, CHEM_ENG\n312-0 Probability and Statistics for Chemical Engineering, IEMS 201-0 Introduction to\nStatistics, MATH 385-0 Probability and Statistics for MMSS, PSYCH 201-0 Statistical\nMethods in Psychology, POLI_SCI 312-0 Statistical Research Methods, SESP 210-0\nIntroduction to Statistics and Research Methodology, and STAT 202-0 Introduction to\nStatistics and Data Science.\n\n2\nNone of the 7 courses may be double-counted toward any major, minor, or certiﬁcate\nexcept as a related course for a major. Double-counting permitted with a home-school\ndistribution requirement, foundational discipline, US or global perspectives, or advanced\nexpression requirement.\n\n3\nWith advance approval of the program director a total of only one non-Northwestern\ncourse, course credit from study abroad, or a course offered by Northwestern's School of\nProfessional Studies (SPS) may count as a business tools course for the minor. Special\naccommodations may be made for transfer students.\n\n4\nEquivalents include ECON 360-1 Foundations of Corporate Finance Theory and\nKELLG_FE 310-0 Principles of Finance.\n\n5\nStudents completing majors in English, History, or Philosophy, may petition the program\ndirector to waive this requirement. However, these students are strongly encouraged to\nconsider taking ENGLISH 282-0 Writing and Speaking in Business because it covers\ncommunications skills related to the business environment that may not be covered in\nwriting-intensive courses in other disciplines.\n"
    },
    {
        "Course Title": "The Catholic Studies Minor",
        "Description": "\nRoman Catholic ways of thinking, living, and organizing the world have been fundamental\nto cultures since the ﬁfth century of the Common Era, and the story of modernity in all its\nvariations cannot be told without Catholicism. The Catholic studies program offers the\n\n\nopportunity to look at civilizations and cultures through the lens of the interdisciplinary\nstudy of Catholicism, using the critical tools of contemporary academic research and\nconversation.\n\nThe minor requires at least 6 courses. These include a core course introducing contextual,\ninterdisciplinary approaches to the subject and the interaction between Catholic ideas\nand institutions and the broader world.\n\nFive elective courses allow students to explore a particular topic more deeply.\nAppropriate courses from other departments (such as art history, English, history, political\nscience, and sociology) can count toward the minor with the department adviser's\napproval.\n\nMinor Requirements\nCourse List\nCourseTitle\nCatholic Studies (6 units)\nRELIGION 381-0\nGlobal Catholicism in the Contemporary World\n5 additional courses:\nMust be chosen with the department adviser from:\nRELIGION 345-0\nIdea of Sainthood in Christianity\nRELIGION 349-0\nTopics in Christianity\nRELIGION 375-0\nFoundations of Christian Thought\nRELIGION 385-0\nTopics in United States Catholicism\nRELIGION 386-0\nTopics in Latin America Catholicism\nOr other relevant courses in religious studies and other departments.\n"
    },
    {
        "Course Title": "The Chemical Engineering Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore Courses (27 units)1\n\n\nCourse List\nCourseTitle\n4 mathematics courses\n4 units of basic science: 2\nPHYSICS 135-2\nGeneral Physics\nCHEM 131-0\n& CHEM 132-0\nFundamentals of Chemistry I\nand Fundamentals of Chemistry II\nor CHEM 151-0\n& CHEM 152-0\nGeneral Chemistry I\nand General Chemistry II\nor CHEM 171-0\n& CHEM 172-0\nAdvanced General Inorganic Chemistry\nand Advanced General Physical Chemistry\nCHEM_ENG 275-0\nMolecular & Cell Biology for Engineers 3\n4 engineering analysis and computer proﬁciency courses\n3 design and communications courses\n7 social sciences/humanities courses\n5 unrestricted electives\nMajor Program (21 units)\nCourse List\nCourseTitle\n16 required courses\nCHEM 215-1\n& CHEM 215-2\nOrganic Chemistry I\nand Organic Chemistry II\nMAT_SCI 301-0\nIntroduction to Materials Science and Engineering Principles\nCOMP_SCI 150-0\nFundamentals of Computer Programming 1.5\nCHEM_ENG 210-0\nAnalysis of Chemical Process Systems\nCHEM_ENG 211-0\n\n\nThermodynamics\nCHEM_ENG 212-0\nPhase Equilibrium and Staged Separations\nCHEM_ENG 307-0\nKinetics and Reactor Engineering\nCHEM_ENG 312-0\nProbability and Statistics for Chemical Engineering\nor IEMS 303-0\nStatistics\nCHEM_ENG 321-0\nFluid Mechanics\nCHEM_ENG 322-0\nHeat Transfer\nCHEM_ENG 323-0\nMass Transfer\nCHEM_ENG 341-0\nDynamics and Control of Chemical and Biological Processes\nCHEM_ENG 342-0\nChemical Engineering Laboratory\nCHEM_ENG 351-0\nProcess Economics, Design, & Evaluation\nCHEM_ENG 352-0\nChemical Engineering Design Projects\n5 technical elective courses\n2 advanced chemical engineering courses from an approved list available from the\ndepartment\n1 engineering course from an approved list available from the department or 1 unit of\nindependent study\n1 advanced science or mathematics course from an approved list available from the\ndepartment\n1 engineering, advanced science, or mathematics course from an approved list available\nfrom the department\n1\nSee general requirements for details.\n\n2\nPHYSICS 125-2 General Physics for ISP or PHYSICS 140-2 Fundamentals of Physics may\nbe substituted for PHYSICS 135-2 General Physics. Concurrent registration with the\nassociated labs (PHYSICS 136-2 General Physics Laboratory or PHYSICS 126-2 Physics\n\n\nLaboratory for ISP) is required. PHYSICS 135-3 General Physics is a required basic\nscience course for students entering before Fall 2023 and is part of the approved\ntechnical elective list for students entering after Fall 2023 and who are using the current\ncatalog. PHYSICS 135-3 General Physics may also be substituted by PHYSICS 125-3\nGeneral Physics for ISP or PHYSICS 140-3 Fundamentals of Physics.\n\n3\nBIOL_SCI 201-0 Molecular Biology or BIOL_SCI 202-0 Cell Biology may substituted for\nCHEM_ENG 275-0 Molecular & Cell Biology for Engineers. Exemptions from this one unit\nof biology coursework are NOT granted for students placing out of BIOL_SCI 201-0\nMolecular Biology through the Biological Sciences Department's placement test. These\nstudents may use CHEM_ENG 275-0 Molecular & Cell Biology for Engineers or BIOL_SCI\n202-0 Cell Biology to complete the required biology unit.\n\nChemistry BA/MS\nStudents who have done outstanding work during their ﬁrst three years and have a\nprofessional interest in chemistry may apply for the BA/MS program when they are within\n4 courses of completing undergraduate degree requirements. By the end of the third year\nthe applicant should have completed nearly all of the 300-level course requirements, all or\nnearly all of the Weinberg College requirements, and at least 1 term of independent study.\n\nInformation about degree requirements can be found in the Graduate Catalog section\ndescribing the combined BA/MS program in Chemistry.\n\nUndergraduate students interested in pursuing this program should contact the Director\nof Undergraduate Studies in Chemistry.\n"
    },
    {
        "Course Title": "The Chemistry Major",
        "Description": "\nThe major is recommended for students planning careers in chemistry. It is suitable\npreparation for graduate study in chemistry or medical school and for work as a\nprofessional chemist. The curriculum includes related courses in mathematics and physics\nas well as core courses and a concentration in chemistry.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\n\n\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nQuantitative Problem Solving in Chemistry\n\nGeneral Chemistry I\n\nCourse List\nCourseTitle\nDepartment Courses (16.7–18.04 units)\n14.7–16.04 core units providing a solid basis in chemistry\nCHEM 110-0\n& CHEM 131-0\n& CHEM 141-0\n& CHEM 132-0\n& CHEM 142-0\nand Fundamentals of Chemistry I\nand Fundamentals of Chemistry Laboratory I\nand Fundamentals of Chemistry II\nand Fundamentals of Chemistry Laboratory II\nor CHEM 151-0\n& CHEM 161-0\n& CHEM 152-0\n& CHEM 162-0\nand General Chemistry Laboratory I\nand General Chemistry II\nand General Chemistry Laboratory II\nor CHEM 171-0\n& CHEM 181-0\n& CHEM 172-0\n& CHEM 182-0\nand Advanced General Inorganic Chemistry Laboratory\nand Advanced General Physical Chemistry\nand Advanced General Physical Chemistry Laboratory\nCHEM 220-0 Introductory Instrumental Analysis\nCHEM 217-1\n& CHEM 237-1\n& CHEM 217-2\n& CHEM 237-2\n& CHEM 217-3\n& CHEM 235-3\nand Accelerated Organic Chemistry Laboratory I\nand Accelerated Organic Chemistry II\n\nAccelerated Organic Chemistry I\n\nAdvanced General Inorganic Chemistry\n\n\nThermodynamics\n\nAdvanced Laboratory 1\n\nand Accelerated Organic Chemistry Laboratory II\nand Accelerated Organic Chemistry III\nand Organic Chemistry Lab III\nStudents who complete the non-majors organic sequence CHEM 215-1, CHEM 215-2,\nand CHEM 215-3 with associated labs, and decide later to major in chemistry, are\npermitted to use these courses in place of CHEM 217-1, CHEM 217-2, and CHEM 217-3\nand associated labs.\nCHEM 333-0 Inorganic Chemistry\nCHEM 342-1\n& CHEM 342-2\n& CHEM 342-3\nand Quantum Mechanics and Spectroscopy\nand Kinetics and Statistical Thermodynamics\nCHEM 350-1\n& CHEM 350-2\n& CHEM 350-3\nand Advanced Laboratory 2\nand Advanced Laboratory 3\n2 courses from one of these concentration areas:\nBiochemistry\nEnvironmental Chemistry\nInorganic Chemistry\nOrganic Chemistry\nPhysical Chemistry\nMaterials/Nanotechnology\nSelf-designed Concentration\nRelated Courses (Units depend on mathematics courses taken.)\nBIOL_SCI 301-0\nor BIOL_SCI 241-0 Biochemistry, Molecular and Cell Biology for ISP - 2\nMATH 220-1\n& MATH 220-2\nand Single-Variable Integral Calculus\nor MATH 218-1\n& MATH 218-2\n& MATH 218-3\nand Single-Variable Calculus with Precalculus\nand Single-Variable Calculus with Precalculus\nMATH 230-1\n& MATH 230-2\n\nSingle-Variable Calculus with Precalculus\n\nSingle-Variable Differential Calculus\n\nMultivariable Differential Calculus\n\nPrinciples of Biochemistry\n\n\nMENU: Intensive Linear Algebra and Multivariable Calculus\n\nMENU: Linear Algebra and Multivariable Calculus\n\nAccelerated Mathematics for MMSS: First Year\n\nAccelerated Mathematics for ISP: First Year\n\nand Multivariable Integral Calculus\nor MATH 281-1\n& MATH 281-2\nand Accelerated Mathematics for ISP: First Year\nor MATH 285-2\n& MATH 285-3\nand Accelerated Mathematics for MMSS: First Year\nor MATH 290-2\n& MATH 290-3\nand MENU: Linear Algebra and Multivariable Calculus\nor MATH 291-2\n& MATH 291-3\nand MENU: Intensive Linear Algebra and Multivariable Calculus\nPHYSICS 125-1\n& PHYSICS 125-2\n& PHYSICS 125-3\n& PHYSICS 126-1\n& PHYSICS 126-2\n& PHYSICS 126-3 General Physics ISP\nand General Physics for ISP\nand General Physics for ISP\nand Physics Laboratory for ISP\nand Physics Laboratory for ISP\nand Physics Laboratory for ISP\nor PHYSICS 135-1\n& PHYSICS 135-2\n& PHYSICS 135-3\n& PHYSICS 136-1\n& PHYSICS 136-2\n& PHYSICS 136-3 General Physics\nand General Physics\nand General Physics\nand General Physics Laboratory\nand General Physics Laboratory\nand General Physics Laboratory\nor PHYSICS 140-1\n& PHYSICS 140-2\n& PHYSICS 140-3\n& PHYSICS 136-1\n\n\nFundamentals of Physics\n\n& PHYSICS 136-2\n& PHYSICS 136-3\nand Fundamentals of Physics\nand Fundamentals of Physics\nand General Physics Laboratory\nand General Physics Laboratory\nand General Physics Laboratory\n"
    },
    {
        "Course Title": "The Chemistry Minor",
        "Description": "\nThe minor in chemistry allows majors in other ﬁelds to complete a signiﬁcant portion of\nthe coursework required for the chemistry major. It allows the ﬂexible selection of\ncoursework from the traditional subdisciplines of organic, inorganic, physical, and\nanalytical chemistry.\n\nCourse List\nCourseTitle\nPrerequisites\nCHEM 132-0\n& CHEM 142-0\nFundamentals of Chemistry II\nand Fundamentals of Chemistry Laboratory II\nor CHEM 152-0\n& CHEM 162-0\nGeneral Chemistry II\nand General Chemistry Laboratory II\nor CHEM 172-0\n& CHEM 182-0\nAdvanced General Physical Chemistry\nand Advanced General Physical Chemistry Laboratory\nor equivalent\nChemistry courses at the 300 level may have additional chemistry, physics, and/or\nmathematics prerequisites.\nMinor Requirements (6 units plus additional units for required labs)\nSix 200- or 300- level full-credit courses 1\n1\nExclusive of CHEM 201-0 Chemistry of Nature and Culture, CHEM 398-0 Undergraduate\nSeminar, CHEM 399-0 Independent Study, or all 0.34-credit lab courses.\n\nLife science majors and premedical students are advised to take:\n\n\nOrganic Chemistry I\n\nCourse List\nCourseTitle\nCHEM 215-1\n& CHEM 235-1\n& CHEM 215-2\n& CHEM 235-2\n& CHEM 215-3\n& CHEM 235-3\nand Organic Chemistry Lab I\nand Organic Chemistry II\nand Organic Chemistry Lab II\nand Organic Chemistry III\nand Organic Chemistry Lab III\nor CHEM 217-1\n& CHEM 237-1\n& CHEM 217-2\n& CHEM 237-2\n& CHEM 217-3\n& CHEM 235-3\nand Accelerated Organic Chemistry Laboratory I\nand Accelerated Organic Chemistry II\nand Accelerated Organic Chemistry Laboratory II\nand Accelerated Organic Chemistry III\nand Organic Chemistry Lab III\n3 additional Chemistry courses\nPhysical science majors are advised to take:\nCourse List\nCourseTitle\nCHEM 342-1\n& CHEM 342-2\n& CHEM 342-3\nand Quantum Mechanics and Spectroscopy\nand Kinetics and Statistical Thermodynamics\n3 additional Chemistry courses\nStudents with interests in materials science, earth and planetary science, or\nenvironmental science should take:\nCourse List\nCourseTitle\nCHEM 215-1\n\nAccelerated Organic Chemistry I\n\nThermodynamics\n\n\nOrganic Chemistry I\n\nOrganic Chemistry II\n\n& CHEM 235-1\nand Organic Chemistry Lab I\nCHEM 215-2\n& CHEM 235-2\nand Organic Chemistry Lab II\nCHEM 333-0 Inorganic Chemistry\n3 additional Chemistry courses\nOther programs for the minor may be designed with departmental approval to suit\nindividual needs; interested students should contact the Director of Undergraduate\nStudies in Chemistry.\n"
    },
    {
        "Course Title": "The Civil Engineering Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore courses (27 units)1\nCourse List\nCourseTitle\n4 mathematics courses\n4 units of basic science: 2\nPHYSICS 135-2\nGeneral Physics\nCHEM 131-0\nFundamentals of Chemistry I\nor CHEM 151-0\nGeneral Chemistry I\nor CHEM 171-0\nAdvanced General Inorganic Chemistry\n1 unit in biological sciences, or\nCIV_ENV 203-0\nEarth in the Anthropocene\nor EARTH 201-0\nEarth Systems Revealed\nor EARTH 202-0\nEarth's Interior\n1 additional unit in biological sciences (200-level or higher), chemistry, or physics, or\nEARTH 201-0\nEarth Systems Revealed\n\n\nor EARTH 202-0\nEarth's Interior\nor CIV_ENV 203-0\nEarth in the Anthropocene\n4 engineering analysis and computer proﬁciency courses\n3 design and communications courses\n7 social sciences/humanities courses\n5 unrestricted electives\n1 unit of unrestricted electives is from Chemistry lab, PHYSICS 136-2, and CIV_ENV\n301-1\nMajor Program (21 units)3\nCourse List\nCourseTitle\n2 basic courses chosen from the options below\nCIV_ENV 201-0\nEngineering Possibilities: Decision Science in the Age of Smart Technologies\nCIV_ENV 202-0\nBiological and Ecological Principles\nCIV_ENV 220-0\nStructural Art\n5 basic engineering courses\nCIV_ENV 216-0\nMechanics of Materials I\nCIV_ENV 304-0\nCivil and Environmental Engineering Systems Analysis\nCIV_ENV 306-0\nUncertainty Analysis\nMECH_ENG 222-0\nThermodynamics & Statistical Mechanics - I\nor BMD_ENG 250-0\nThermodynamics\nor CHEM_ENG 211-0\nThermodynamics\nMECH_ENG 241-0\nFluid Mechanics I\n4 civil engineering breadth courses\nCIV_ENV 221-0\nTheory of Structures I\nCIV_ENV 250-0\n\n\nEarth Surface Engineering\nCIV_ENV 260-0\nEnvironmental Systems and Processes\nCIV_ENV 371-0\nIntroduction to Transportation Planning and Analysis\nor CIV_ENV 376-0\nTransportation System Operations\n4 courses chosen from the focus areas below 4,5\nArchitectural Engineering & Design\nEnvironmental\nGeotechnics\nManagement\nStructures\nTransportation\n2 capstone design courses (0.5 units each)\nCIV_ENV 382-1\n& CIV_ENV 382-2\nCapstone Design I\nand Capstone Design II\n5 technical elective courses 6\n300 level or higher in mathematics, science, engineering, or another area supporting the\narea of specialization\n1 professional development course (0.34 units) 7\nCIV_ENV 301-1\nProfessional Development Seminar I\n1\nSee general requirements for details.\n\n2\nPHYSICS 125-2 General Physics for ISP or PHYSICS 140-3 Fundamentals of Physics may\nbe substituted for PHYSICS 135-2 General Physics. Associated lab is PHYSICS 126-2\nPhysics for ISP Laboratory or PHYSICS 136-2 General Physics Laboratory.\n\n3\nAt least 17 out of the 21 units in the major program must be CIV_ENV courses with 100%\nengineering topic; only GEN_ENG 220-1 Analy/Comp Graph and GEN_ENG 220-2\nAnaly/Comp Graph II may be taken P/N.\n\n4\n\n\nMust select from an approved list available in Undergraduate CIV_ENV Handbook; must\nchoose at least 2 design courses3 from 2 focus areas.\n\n5\nDesign is deﬁned as courses taught by licensed Professional Engineer or equivalent as\ndeﬁned by ABET and use appropriate codes and/or standards.\n\n6\nGEN_ENG 220-1 Analy/Comp Graph and GEN_ENG 220-2 Analy/Comp Graph II may\ncount toward this requirement; only 1 unit of CIV_ENV 399-0 Projects may be counted;\nno 399 from another department is accepted. Choose from an approved list available in\nUndergraduate CIV_ENV Handbook.\n\n7\n0.34 units may count towards unrestricted electives.\n"
    },
    {
        "Course Title": "The Classics Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nThe major in classics offers students three paths of study. Although no previous\nknowledge of Latin or Greek is required, all students are required to achieve competence\nin one of these ancient languages in order to work with primary sources in the original.\nSome may choose to complete advanced work in both languages.\n\nWith concentrations in Latin, Greek, or both languages, the major requirements allow\nsome ﬂexibility. Classics majors develop familiarity with the broad sweep of ancient\nhistory and literature and key analytical skills necessary to examine the record of Greek\nand Roman culture. They complete a demanding and distinctive course of study that\nstresses the development of important intellectual sensibilities—close reading, analytical\nclarity, thorough research, evaluation of evidence, logical analysis, effective writing,\nappreciation of nuance and subtleties, historical variability, and cultural differences. All\nmajors complete a research project under the direction of a faculty member in a small\n\n\n1-quarter seminar. Seniors pursuing honors will undertake an additional 2 quarters of\nresearch.\n\nEach of the three tracks—Greek and Latin, Latin, or Greek—requires a minimum of 12\ncourses beyond the language prerequisites.\n\nAll majors are required to undertake a research project in connection with CLASSICS\n395-0 Research Seminar. Topics vary from year to year. Instruction will be included in the\nuse of traditional as well as digital research tools. Students may petition the director of\nundergraduate studies to substitute research conducted for a study abroad program.\n\nEXPAND ALL\nGreek and Latin Concentration\nLatin Concentration\nGreek Concentration\nHonors in Classics\nMajors with strong academic records and an interest in pursuing honors should speak\nwith the Director of Undergraduate Studies and submit an application form in junior year\nno later than the College reading period in Spring Quarter. Students should list a\npreliminary bibliography for the project approved by a faculty member who has agreed to\nserve as the thesis adviser. A one-page research proposal approved by the adviser is due\nat the end of the ﬁrst week of the Fall Quarter of the senior year. The Honors Committee,\nconsisting of the Director of Undergraduate Studies, the Honors Coordinator and a third\nClassics faculty member, will evaluate the proposal and vote on approval. During the fall\nand winter quarters of their senior year, students enroll in CLASSICS 399-0, Independent\nStudy and complete a senior thesis. Students must be in residence during these terms. All\nhonors theses are evaluated as passing or not-passing by the Honors Committee.\nStudents whose theses and grades meet departmental criteria are recommended to the\nCollege for graduation with honors. For more information consult the department website\nor the director of undergraduate studies.\n"
    },
    {
        "Course Title": "The Classics Minor",
        "Description": "\nStudents may earn a minor in Latin, Greek, or classical studies. Each option allows\nstudents either to survey aspects of classical culture and traditions or to take a more\nfocused cluster of courses. Unlike the Greek and Latin minors, the classical studies minor\ndoes not require study of an ancient language. Instead, it provides a framework for\nexamining any aspect of Greek and Roman antiquity or its traditions and reception in\nmedieval through contemporary Western culture.\n\n\nStudents majoring in classics may also earn a minor in classical studies, provided they do\nnot double-count courses toward both the major and the minor, and they do not count\ntoward the minor any courses in the language(s) of their major at or below the\nprerequisite level.\n\nEXPAND ALL\nMinor requirements: Latin concentration (6 units)\nMinor requirements: Greek concentration (6 units)\nMinor requirements: Classical studies (6 units)"
    },
    {
        "Course Title": "The Cognitive Science Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nMajor Requirements (14 units)\n4 required introductory courses:\nCOG_SCI 110-0\nIntroduction to Cognitive Science\nCOMP_SCI 110-0\nIntroduction to Computer Programming\nor COMP_SCI 111-0\nFundamentals of Computer Programming\nSTAT 202-0\nIntroduction to Statistics and Data Science\nor PSYCH 201-0\nStatistical Methods in Psychology\nCOG_SCI 202-0\nEvaluating Evidence\n1 required proseminar\nCOG_SCI 366-0\nCognitive Science Proseminar\n5 Theme courses, one from each of the ﬁve themes listed below.\nTheme: Brains & Bodies\n\n\nCOG_SCI 210-0\nLanguage and the Brain\nLING 250-0\nSound Patterns in Human Language\nMUS_THRY 251-0\nIntro to Music Cognition\nNEUROSCI 326-0\nNeurobiology of Learning and Memory\nPSYCH 221-0\nIntroduction to Neuroscience\nTheme: Learning over Lifetimes\nCOG_SCI 211-0\nLearning, Representation & Reasoning\nPSYCH 228-0\nCognitive Psychology\nPSYCH 244-0\nDevelopmental Psychology\nTheme: Models & Machines\nCOG_SCI 207-0\nIntroduction to Cognitive Modeling\nCOMP_SCI 348-0\nIntroduction to Artiﬁcial Intelligence\nLING 260-0\nFormal Analysis of Words & Sentences\nLING 334-0\nIntroduction to Computational Linguistics\nPHIL 225-0\nMinds and Machines\nPHIL 325-0\nPhilosophy of Mind\nTheme: Reasoning & Rhetoric\nLING 270-0\nMeaning\nPHIL 255-0\nTheory of Knowledge\nPOLI_SCI 335-0\nPolitical Psychology\nPSYCH 333-0\nPsychology of Thinking\n\n\nPSYCH 373-0\nDecision Making\nTheme: Collective Cognition\nANTHRO 377-0\nPsychological Anthropology\nCOG_SCI 345-0\nPresenting Ideas & Data\nLOC 214-0\nCulture and Cognition\nLOC 308-0\nRedesigning Everyday Organizations\nLOC 313-0\nLearning and Thinking in Organizations\nPSYCH 344-0\nCultural Psychology\n4 Electives chosen from the Theme lists above or from the Electives listed below\nOf the 9 Theme and Elective courses (5 Theme courses plus 4 Electives) at least ﬁve must\nbe at the 300-level or above. Other 300- and 400-level courses beyond those listed here\nmay be counted as Electives with consent of the cognitive science adviser.\n\nIndependent study is strongly recommended. COG_SCI 399-0 or another independent\nstudy approved by the cognitive science adviser may count as an Elective course.\n\nFor students pursuing honors, the second quarter Senior Thesis Seminar (COG_SCI 398-2)\nmay count as an Elective course.\n\nAt most 3 courses counted toward the cognitive science major may be double-counted\ntoward another major. Courses used to meet major requirements may not be\ndouble-counted toward a minor.\n\nElectives\nStudents following the major requirements in this catalog year may chose any of the\nelective courses listed below regardless of academic area. Students following\nrequirements in a prior catalog year should refer to that catalog for the required\nallocation of courses among designated advanced elective areas.\n\nElective Courses\nHonors in Cognitive Science\n\n\nMajors with strong academic records and an interest in pursuing honors should contact\nthe director of undergraduate studies in early spring of junior year. Qualifying students\nprepare a thesis proposal under the guidance of a faculty mentor and present the\nproposal, along with the names of the mentor and a second faculty reader, to the program\ncommittee for review. After committee approval of the proposal, students normally enroll\nin COG_SCI 398-1 Senior Thesis Seminar in fall and COG_SCI 398-2 Senior Thesis\nSeminar in winter of senior year. With the permission of the director of undergraduate\nstudies, 1 quarter of COG_SCI 399-0 Independent Study may be substituted for one of\neither COG_SCI 398-1 Senior Thesis Seminar or COG_SCI 398-2 Senior Thesis Seminar.\n\nStudents whose projects, theses, and grades meet program criteria are recommended to\nthe college for graduation with honors. For more information consult the director of\nundergraduate studies and see the section on Honors in Cognitive Science on the\nCognitive Science Undergraduate page\n"
    },
    {
        "Course Title": "The Cognitive Science Minor",
        "Description": "\nThe minor in cognitive science broadens the academic background of students majoring in\nrelated ﬁelds, providing them with the methods and foundations for understanding\ncognitive issues in an interdisciplinary framework.\n\nCourse List\nCourseTitle\nMinor Requirements (8 units)\n2 required introductory courses:\nCOG_SCI 110-0\nIntroduction to Cognitive Science\nCOG_SCI 202-0\nEvaluating Evidence\n1 methodology course chosen from:\nCOMP_SCI 110-0\nIntroduction to Computer Programming\nCOMP_SCI 111-0\nFundamentals of Computer Programming\nPSYCH 201-0\nStatistical Methods in Psychology\nSTAT 202-0\nIntroduction to Statistics and Data Science\n3 Theme courses, each selected from a different one of the ﬁve themes listed below\nTheme: Brains & Bodies\n\n\nCOG_SCI 210-0\nLanguage and the Brain\nLING 250-0\nSound Patterns in Human Language\nMUS_THRY 251-0\nIntro to Music Cognition\nNEUROSCI 326-0\nNeurobiology of Learning and Memory\nPSYCH 221-0\nIntroduction to Neuroscience\nTheme: Learning over Lifetimes\nCOG_SCI 211-0\nLearning, Representation & Reasoning\nPSYCH 228-0\nCognitive Psychology\nPSYCH 244-0\nDevelopmental Psychology\nTheme: Models & Machines\nCOG_SCI 207-0\nIntroduction to Cognitive Modeling\nCOMP_SCI 348-0\nIntroduction to Artiﬁcial Intelligence\nLING 260-0\nFormal Analysis of Words & Sentences\nLING 334-0\nIntroduction to Computational Linguistics\nPHIL 225-0\nMinds and Machines\nPHIL 325-0\nPhilosophy of Mind\nTheme: Reasoning & Rhetoric\nLING 270-0\nMeaning\nPHIL 255-0\nTheory of Knowledge\nPOLI_SCI 335-0\nPolitical Psychology\nPSYCH 333-0\nPsychology of Thinking\n\n\nPSYCH 373-0\nDecision Making\nTheme: Collective Cognition\nANTHRO 377-0\nPsychological Anthropology\nCOG_SCI 345-0\nPresenting Ideas & Data\nLOC 214-0\nCulture and Cognition\nLOC 308-0\nRedesigning Everyday Organizations\nLOC 313-0\nLearning and Thinking in Organizations\nPSYCH 344-0\nCultural Psychology\n2 Elective courses 1\n1\nElective courses can be chosen from the Theme lists above or from the Elective Courses\nlist shown under the Cognitive Science major.\n"
    },
    {
        "Course Title": "The Communication Studies Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nMajor Requirements (13 units)\nAll courses for SoC majors, minors, ﬁelds of concentration and distribution requirements\nmust be completed with a grade of C- or higher and may not be taken P/N.\n\nSoC Courses (1 unit)\n2 0.5-unit seminars:\nCourse List\nCourseTitle\nCMN 101-0 SoC First Year Seminar: Interdisciplinary Topics in Communication Arts &\nSciences\nCMN 398-0 School of Communication Senior Seminar\nIntroductory Courses (3 units)\nIntroductory courses to be completed in the ﬁrst year of studies in the major:\nCourse List\nCourseTitle\n\n\nPublic Speaking\n\nResearch Methods in Comm Studies\nTheories of Persuasion\nPrinciples of Rhetorical Criticism\nTheories of Argumentation\n\nCOMM_ST 101-1 Communication in Context: Introduction\nCOMM_ST 101-2 Communication in Context: Analysis & Research\nCOMM_ST 102-0\n200-Level Courses (3 units)\nAny 3 of these 200-level courses, to be completed before the end of the sophomore year\nbecause the material covered is prerequisite to more advanced courses:\nCourse List\nCourseTitle\nCOMM_ST 201-0\nCOMM_ST 205-0\nCOMM_ST 215-0\nCOMM_ST 220-0\nCOMM_ST 225-0 Communication and Culture\nCOMM_ST 227-0 Communication & Technology\nTheories of Relational Communication\nCOMM_ST 241-0\nIntro to Health Communication\nCOMM_ST 246-0\nCOMM_ST 250-0\nTeam Leadership and Decision Making\nCOMM_ST 255-0 Understanding Media Markets: Users, Makers and Metrics\nCOMM_ST 261-0\nCOMM_ST 270-0 Media Effects\nCOMM_ST 274-0\nCOMM_ST 275-0\nCOMM_ST 295-0\nAdvanced Courses (6 units)\n6 additional communication studies courses at the 300 level.\nNo more than 1 of the following courses may be included in these 6 courses for the major.\n(Additional courses can be applied as electives).\nCourse List\nCourseTitle\nCMN 340-0 School of Communication EPICS Internship Seminar\nCOMM_ST 389-0\nCOMM_ST 397-0 Honors Seminar\nCOMM_ST 398-0 Undergraduate Seminar\nCOMM_ST 399-0\nAdditional Requirements (29 units)\nDistribution Requirements (18 units)\n18 units of credit outside the department, including 3 units of credit from each of the\nthree School of Communication distribution areas: science, mathematics, and technology;\nindividual and social behavior; and humanities and ﬁne arts.\n\nPower in Entertainment\nPersuasive Images: Rhetoric of Popular Culture\nTopics in Communication Studies\n\nIntroduction to Strategic Communication\n\nPracticum in Communication Research\n\nIndependent Study\n\n\nElectives (11 units)\nElectives in communication and other areas to complete a minimum of 42 units of credit.\n\nConcentration Outside the School of Communication\nA ﬁeld of concentration outside the School of Communication (normally one of the\ndisciplines of the Weinberg College of Arts and Sciences), consisting of at least 6 units of\ncredit; of these 6, at least 3 must be 300- or 400-level courses. A non–School of\nCommunication minor, dual major, or adjunct major satisﬁes this requirement. Courses\ntaken to satisfy the ﬁeld of concentration requirement may fulﬁll distribution or elective\ncourse requirements.\n\nLanguage Requirement\nProﬁciency in a classical or modern foreign language equivalent to the work covered in a\nsecond-year college-level course (proﬁciency is established in precisely the same manner\nas in the Weinberg College of Arts and Sciences; see foreign language requirements).\nCourses taken to satisfy the language requirement may fulﬁll distribution or elective\ncourse requirements.\n"
    },
    {
        "Course Title": "The Honors in Communication Studies Major",
        "Description": "\nThe Undergraduate Honors Program in Communication Studies offers an opportunity for\nhighly motivated Communication Studies majors to conduct original scholarly research.\nEach student works closely with faculty to produce an original research project in an\ninterest area determined by the student. Seniors who successfully complete the program\nwill be eligible to graduate with departmental honors. Also see Honors and Prizes in\nGraduation Honors.\nComparative Literary Studies BA/MA\nStudents with a strong record in their major courses and an interest in graduate study are\neligible to apply for the BA/MA program in comparative literary studies once they are\nwithin 4 courses of completing their undergraduate degrees. The application requires a\nstatement of purpose, a plan of study, and two letters of recommendation from\ndepartment faculty.\n\nInformation about degree requirements can be found in the Graduate Catalog section\ndescribing the combined BA/MA program in Comparative Literary Studies.\n"
    },
    {
        "Course Title": "The Comparative Literary Studies Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nStudents pursuing a program of study in comparative literature need to be acquainted\nwith at least two literary traditions. They choose a ﬁrst literature, normally that written in\ntheir native tongue, and a second literature written in another language. They take at least\n2 courses in each. They also take at least 2 courses in non-Euro/American literature, either\nin translation or in the original language.\n\nThe core 200-level CLS courses provide students with a range of theoretical approaches\nto literary texts in partic ular and the study of culture in general. Advanced or 300-level\nCLS courses build on these core courses, allowing students to use their linguistic skills to\nfurther explore literary themes, movements, genres, and periods on a comparative basis.\n\nDuring their junior year, majors in CLS should meet with the director of undergraduate\nstudies (DUS) to ensure they are on track to complete requirements for the major,\nincluding literature courses taken in different genres, periods and regions, as speciﬁed by\nthe major description. By spring of their junior year, students must choose a faculty\nadvisor and begin to outline a senior research project.\n\nAll majors are required to take COMP_LIT 398-0 Senior Seminar in fall quarter of senior\nyear, during which they write a substantial senior paper (which may be based on a\nprevious paper written for another course). Students meeting the necessary requirements\nmay opt to pursue honors in the major, by enrolling in COMP_LIT 399-0 Independent\nStudy in the winter quarter of their senior year, and expanding their senior essay into an\nHonors Thesis.\n\nMajor Requirements (12 units)\n2 courses required for all majors:\nCOMP_LIT 200-0 Introduction to Literary Theory\nCOMP_LIT 398-0 Senior Seminar (taken during Fall quarter of senior year)\n10 literature courses, which must encompass the following categories (a single course\nmay ﬁll multiple requirements):\n200-level COMP_LIT courses: 2 core courses in comparative literary studies, chosen from:\nCourse List\nCourseTitle\n\n\nReading World Literature\nInterpreting Culture\nReading Difference\nIntroduction to Critical Theory\nReadings in Genre\n\nCOMP_LIT 201-0\nCOMP_LIT 202-0\nCOMP_LIT 205-0\nCOMP_LIT 207-0\nCOMP_LIT 211-0\n300-level COMP_LIT courses: 3 advanced courses in comparative literary studies (chosen\nfrom any COMP_LIT 300-level course, except 398 or 399)\nLanguage: 4 courses\n2 courses in ﬁrst language, at least one 300-level\n2 courses in second language, at least one 300-level (modiﬁcation by consent of director\nof undergraduate studies)\n Genre: One course each devoted to three of the following four genre categories:\nPoetry\nDrama & Performance\nNarrative\nFilm & Visual Studies\n\nPeriod: Two courses in each of two broad periods:\nPre-1830 \n1830-present\nRegion: Two non-Euro/American courses (can be in translation)\nIf the above category requirements are not fulﬁlled by the minimum of 10 literature\ncourses, additional courses may be required. At most 2 courses counted toward the\nComparative Literary Studies major may be double-counted toward another major.\n\nHonors in Comparative Literary Studies\nMajors with strong academic records may be recommended to pursue honors based on\nthe strength of their senior essays. Recommended students expand their senior essay into\na senior thesis (at least 30 pages long) during 1 quarter of independent study (COMP_LIT\n399-0 Independent Study), preferably in winter quarter. The COMP_LIT 399-0\nIndependent Study enrollment does not count toward the 12 courses required for the\nmajor. Students whose theses and grades meet program criteria are recommended to the\ncollege for graduation with honors. For more information consult the program website\nand Honors in the Major.\n"
    },
    {
        "Course Title": "The Composition Major",
        "Description": "\nBachelor of Music degrees in composition require a minimum of 48 units, and include core\nmusic requirements (15 units), major requirements (19 units), Foundational Disciplines (6\nunits), and elective requirements (8 units).\n\n\nEXPAND ALL\nMusic Core Requirements (15 units)\nComposition Major Requirements (19 units)\nFoundational Disciplines (6 units, chosen from 7 categories) and Elective Requirements (8\nunits)\n"
    },
    {
        "Course Title": "The Composition Minor",
        "Description": "\nA minor in composition requires 9 units, of which a minimum of 5 courses are not\ndouble-counted toward the major.\n\nCourse List\nCourseTitle\nMUS_COMP 211-0 Class Composition (six quarters)\nMUS_COMP 314-1 Instrumentation\nor MUS_COMP 314-2\nOne elective course in MUS_COMP\nOne elective course in MUS_TECH\n\nOrchestration\n"
    },
    {
        "Course Title": "The Computer Engineering Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore Courses (27 units)1\nCourse List\nCourseTitle\n4 mathematics courses\n4 units of basic science:\nPHYSICS 135-2\n& PHYSICS 135-3\nGeneral Physics\nand General Physics\nPHYSICS 136-2\n& PHYSICS 136-3\nGeneral Physics Laboratory\nand General Physics Laboratory\n1.33 units chosen from McCormick-approved basic science categories of Chemistry,\nPhysics, Biological Science, Earth & Planetary Science or Astronomy 2\n\n\n4 engineering analysis and computer proﬁciency courses\n3 design and communication courses\n7 social sciences/humanities courses\n5 unrestricted electives\nMajor Program (21 units)\nCourse List\nCourseTitle\n10 required courses\nCOMP_ENG 203-0\nIntroduction to Computer Engineering\nCOMP_ENG 205-0\nFundamentals of Computer System Software\nCOMP_ENG 303-0\nAdvanced Digital Design\nCOMP_ENG 361-0\nComputer Architecture I\nCOMP_SCI 111-0\nFundamentals of Computer Programming\nCOMP_SCI 211-0\nFundamentals of Computer Programming II\nELEC_ENG 202-0\nIntroduction to Electrical Engineering\nELEC_ENG 302-0\nProbabilistic Systems\nELEC_ENG 221-0\nFundamentals of Circuits\n1 additional course from a McCormick department at 200-level or higher comprised of\n100% Engineering Topics based on ABET Course Partitioning Table\n10 technical elective courses\n2 courses chosen from the options below\nCOMP_SCI 213-0\nIntroduction to Computer Systems\nELEC_ENG 222-0\nFundamentals of Signals & Systems\nELEC_ENG 223-0\nFundamentals of Solid State Engineering\nELEC_ENG 224-0\nFund of Electromagnetics & Photonics\nELEC_ENG 225-0\n\n\nFundamentals of Electronics\n5 courses from the areas below\nArchitecture and high-performance computing (see below)\nVLSI and CAD (see below)\nEmbedded systems (see below)\nSoftware systems (see below)\nNetworks and security (see below)\n3 elective courses chosen from the options below\n300-level technical courses in science, mathematics, computer science, or engineering 3\nBIOL_SCI 201-0\nMolecular Biology\nBIOL_SCI 202-0\nCell Biology\nBIOL_SCI 203-0\nGenetics and Evolution\nCHEM 215-1\n& CHEM 215-2\n& CHEM 215-3\nOrganic Chemistry I\nand Organic Chemistry II\nand Organic Chemistry III\n1 design course chosen from the options below\nCOMP_ENG 347-1\nMicroprocessor Systems Project I\nCOMP_ENG 362-0\nComputer Architecture Projects\nCOMP_ENG 392-0\nVLSI Systems Design Projects\n1\nSee general requirements for details.\n\n2\nPHYSICS 125-2 General Physics for ISP or PHYSICS 140-3 Fundamentals of Physics may\nbe substituted for PHYSICS 135-2 General Physics. PHYSICS 125-3 General Physics for\nISP or PHYSICS 140-3 Fundamentals of Physics may be substituted for PHYSICS 135-3\nGeneral Physics. Associated labs are PHYSICS 126-2 Physics Laboratory for ISP or\nPHYSICS 136-2 General Physics Laboratory and PHYSICS 126-3 Physics Laboratory for\nISP or PHYSICS 136-3 General Physics Laboratory.\n\n\n3\nNo more than 2 units of COMP_ENG 399-0 Projects will be counted as technical electives.\nAdditional units of COMP_ENG 399-0 Projects may be taken but will be counted as\nunrestricted electives.\n\nArea Electives\nEXPAND ALL\nArchitecture and High-Performance Computing\nVLSI and CAD\nEmbedded Systems\nSoftware Systems\nNetworks and Security\n"
    },
    {
        "Course Title": "The Computer Science Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore Courses (27 units)1\nCourse List\nCourseTitle\n4 mathematics courses\nMATH 220-1\nSingle-Variable Differential Calculus\nMATH 220-2\nSingle-Variable Integral Calculus\nMATH 228-1\nMultivariable Differential Calculus for Engineering\nCOMP_SCI 212-0\nMathematical Foundations of Comp Science\n4 units of basic science chosen according to McCormick basic science guidelines\n4 engineering analysis and computer proﬁciency courses\nGEN_ENG 205-1\n& GEN_ENG 205-2\n& GEN_ENG 205-3\nEngineering Analysis I\nand Engineering Analysis II\nand Engineering Analysis III\nor GEN_ENG 206-1\n\n\n& GEN_ENG 206-2\n& GEN_ENG 206-3\nHonor Engineering Analysis\nand Honors Engineering Analysis\nand Honors Engineering Analysis\nCOMP_SCI 111-0\nFundamentals of Computer Programming 2\n3 design and communications courses\n7 social sciences/humanities courses\n5 unrestricted electives\nMajor Program (21 units)\nCourse List\nCourseTitle\n5 required courses\nCOMP_SCI 150-0\nFundamentals of Computer Programming 1.5\nCOMP_SCI 211-0\nFundamentals of Computer Programming II\nCOMP_SCI 213-0\nIntroduction to Computer Systems\nCOMP_SCI 214-0\nData Structures & Algorithms\nIEMS 201-0\nIntroduction to Statistics\nor IEMS 303-0\nStatistics\nor ELEC_ENG 302-0\nProbabilistic Systems\nor STAT 210-0\nIntroduction to Probability and Statistics\n3 advanced elective courses\nAny 300-level or higher class, or introductory courses that directly support computer\nscience (COG_SCI 207-0, COMP_ENG 203-0, COMP_ENG 205-0, COMP_SCI 260-0,\nCOMP_SCI 296-0, COMP_SCI 298-0, MECH_ENG 233-0)\n5 breadth courses chosen from the options below\n6 technical electives chosen from the options below\n2 project courses chosen from the options below\n1\nSee general requirements for details.\n\n\n2\nCOMP_SCI 110-0 Introduction to Computer Programming may be used as an unrestricted\nelective if taken before COMP_SCI 111-0 Fundamentals of Computer Programming. It\nmay not, however, be applied to the computer science major requirements.\n\nBreadth Courses\nMajors must take one course from each area. Minors must take one course from each of\nany three areas.\n\nEXPAND ALL\nTheory\nSystems\nArtiﬁcial Intelligence\nInterfaces\nSoftware Development and Programming Languages\nProject Courses\nMajors must take two courses from this list.\n\nProject course list\nTechnical electives\nMajors must take six technical electives. Any 300- or 400-level COMP_SCI course may be\ntaken as a technical elective. In addition the following courses may also be taken as\ntechnical electives:\n\nCourse List\nCourseTitle\nCOMP_ENG 303-0 Advanced Digital Design\nCOMP_ENG 329-0 The Art of Multicore Concurrent Programming\nCOMP_ENG 334-0 Fundamentals of Blockchains and Decentralization\nCOMP_ENG 346-0 Microprocessor System Design\nCOMP_ENG 355-0 ASIC and FPGA Design\nCOMP_ENG 356-0 Introduction to Formal Speciﬁcation & Veriﬁcation\nCOMP_ENG 357-0 Design Automation in VLSI\nCOMP_ENG 358-0 Introduction to Parallel Computing\nCOMP_ENG 361-0 Computer Architecture I\nCOMP_ENG 362-0 Computer Architecture Projects\nCOMP_ENG 364-0 CyberPhysical Systems Design and Application\nCOMP_ENG 365-0 Internet-of-things Sensors, Systems, And Applications\n\n\nCOMP_ENG 366-0 Embedded Systems\nCOMP_ENG 368-0 Programming Massively Parallel Processors with CUDA\nCOMP_ENG 452-0 Adv Computer Architecture\nCOMP_ENG 453-0 Parallel Architectures\nCOMP_ENG 456-0 Modern Topics in Computer Architecture\nCOMP_ENG 459-0 VLSI Algorithmics\nCOMP_ENG 464-0 Cyber-Physical Systems Design and Application\nCOMP_ENG 465-0 Internet-of-things Sensors, Systems, And Applications\nCOMP_ENG 466-0 Embedded Systems\nCOMP_ENG 468-0 Programming Massively Parallel Processors with CUDA\nELEC_ENG 326-0\nELEC_ENG 332-0\nELEC_ENG 375-0 Machine Learning: Foundations, Applications, and Algorithms\nELEC_ENG 433-0\nELEC_ENG 435-0 Deep Learning: Foundations, Applications, and Algorithms\n\nElectronic System Design I\nIntroduction to Computer Vision\n\nStatistical Pattern Recognition\n"
    },
    {
        "Course Title": "The Computer Science Minor",
        "Description": "\nThe department offers a minor in computer science for students who wish to develop\nstronger competence in computer science while pursuing a degree in another ﬁeld. The\nminor will provide essential knowledge for all computer scientists as well as exposure to\nevery critical subﬁeld of the discipline.\n\nStudents should begin the minor before the end of their ﬁrst quarter of their junior year.\nTo declare the McCormick Computer Science minor, students should submit the minor\ndeclaration form in MAS (McCormick Advising System) by the end of their junior year. At\nleast 4 courses used for the minor may not be used (double-counted) to fulﬁll\nrequirements in the student's 21-unit major program.\n\nCourse List\nCourseTitle\nRequirements (15 units)\nPrerequisites (6 units)\nMATH 220-1\nSingle-Variable Differential Calculus\nMATH 220-2\nSingle-Variable Integral Calculus\nMATH 228-1\nMultivariable Differential Calculus for Engineering\nEngineering Analysis (3 units):\n\n\nGEN_ENG 205-1\n& GEN_ENG 205-2\n& GEN_ENG 205-3\nEngineering Analysis I\nand Engineering Analysis II\nand Engineering Analysis III\nor GEN_ENG 206-1\n& GEN_ENG 206-2\n& GEN_ENG 206-3\nHonor Engineering Analysis\nand Honors Engineering Analysis\nand Honors Engineering Analysis\nMinor Requirements (9 units)\nCore Courses (6 units of computer science) 1\nCOMP_SCI 111-0\nFundamentals of Computer Programming\nCOMP_SCI 150-0\nFundamentals of Computer Programming 1.5\nCOMP_SCI 211-0\nFundamentals of Computer Programming II\nCOMP_SCI 212-0\nMathematical Foundations of Comp Science\nCOMP_SCI 213-0\nIntroduction to Computer Systems\nCOMP_SCI 214-0\nData Structures & Algorithms\nBreath Courses (3 units from three different areas, see below)\n1\nStudents without prior programming experience may wish to take COMP_SCI 110-0\nIntroduction to Computer Programming before COMP_SCI 111-0 Fundamentals of\nComputer Programming\n\nBreadth Courses\nMajors must take one course from each area. Minors must take one course from each of\nany three areas.\n\nEXPAND ALL\nTheory\nSystems\n\n\nArtiﬁcial Intelligence\nInterfaces\nSoftware Development and Programming Languages\n\nComputer Science Minor (Weinberg College)\nThe program offers a minor in computer science for students who wish to develop a\nstrong competence in computer science while majoring in another area.\n\nSingle-Variable Differential Calculus\n\nSingle-Variable Calculus with Precalculus\n\nCourse List\nCourseTitle\nPrerequisites\nMATH 220-1\n& MATH 220-2\nand Single-Variable Integral Calculus\nor MATH 218-1\n& MATH 218-2\n& MATH 218-3\nand Single-Variable Calculus with Precalculus\nand Single-Variable Calculus with Precalculus\nMATH 230-1 Multivariable Differential Calculus\nor MATH 228-1\nMATH 240-0 Linear Algebra\nMinor Requirements (9 units)\n6 core courses\nFundamentals of Computer Programming 1\nCOMP_SCI 111-0\nFundamentals of Computer Programming 1.5\nCOMP_SCI 150-0\nCOMP_SCI 211-0\nFundamentals of Computer Programming II\nCOMP_SCI 212-0 Mathematical Foundations of Comp Science\nCOMP_SCI 213-0\nCOMP_SCI 214-0 Data Structures & Algorithms\n3 breadth courses in 3 separate breadth areas (see below)\n1\nStudents without programming experience may want to ﬁrst take COMP_SCI 110-0\nIntroduction to Computer Programming, ideally in the Python programming language.\n\nMultivariable Differential Calculus for Engineering\n\nIntroduction to Computer Systems\n\nBreadth Courses\nMajors must take one course from each area. Minors must take one course from each of\nany three areas.\n\n\nEXPAND ALL\nTheory\nSystems\nArtiﬁcial Intelligence\nInterfaces\nSoftware Development and Programming Languages\n"
    },
    {
        "Course Title": "The Genre Minor",
        "Description": "\nCourse List\nCourseTitle"
    },
    {
        "Course Title": "The genre Minor",
        "Description": "\n3 introductory courses:\nENGLISH 206-0\nReading & Writing Poetry\nENGLISH 207-0\nReading and Writing Fiction\nENGLISH 208-0\nReading & Writing Creative Non-Fiction\n3 courses (2 from one genre and 1 in a cross-genre) chosen from:\nENGLISH 306-0\nAdvanced Poetry Writing\nENGLISH 307-0\nAdvanced Creative Writing\nENGLISH 308-0\nAdvanced Creative Nonﬁction Writing\nENGLISH 309-0\nAdvanced Creative Cross-Genre Writing\n2 300-level English-department literature courses:\n1 on works written before 1830\n1 on works written after 1830\n"
    },
    {
        "Course Title": "The Creative Writing Major",
        "Description": "\nStudents may apply to major in creative writing. Admission to the creative writing major is\ncompetitive, based on a manuscript of creative work from ENGLISH 206-0 Reading &\nWriting Poetry, ENGLISH 207-0 Reading and Writing Fiction, or ENGLISH 208-0 Reading\n& Writing Creative Non-Fiction. The major offers an apprenticeship in the writing of\npoetry, ﬁction, and creative nonﬁction. A strong literature component and a course in the\n\n\nhistory and culture of lit erary production anchor the writing within a context of general\nliteracy.\n\nThe department accepts applications to the creative writing major early each spring. First\nyear students may not apply.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nReading & Writing Poetry\nReading and Writing Fiction\nReading & Writing Creative Non-Fiction\n\nCourse List\nCourseTitle\nDepartment Courses (13 units)\n3 introductory courses:\nENGLISH 206-0\nENGLISH 207-0\nENGLISH 208-0\n10 additional courses:\n1 yearlong theory and practice sequence:\nENGLISH 393-1\n& ENGLISH 393-2\n& ENGLISH 393-3 Theory and Practice of Poetry\nand Theory and Practice of Poetry\nand Theory and Practice of Poetry\nor ENGLISH 394-1\n& ENGLISH 394-2\n& ENGLISH 394-3 Theory & Practice of Fiction\nand Theory & Practice of Fiction\nand Theory & Practice of Fiction\nor ENGLISH 395-1\n& ENGLISH 395-2\n& ENGLISH 395-3 Theory and Practice of Creative Nonﬁction\nand Theory and Practice of Creative Nonﬁction\nand Theory and Practice of Creative Nonﬁction\nENGLISH 392-0\n\nThe Situation of Writing\n\n\n6 300-level English department literature courses\nAt least 2 on works written before 1830\nAt least 2 on works written after 1830\nRelated Courses (2 units)\nChosen from ﬁelds outside of literature but still related to the student’s demonstrated\ninterests within the major\nSelected with the advice and consent of the student’s writing major adviser\nHonors in Creative Writing\nCreative writing majors who are completing the yearlong theory and practice sequence in\npoetry, ﬁction, or creative non ﬁction and who have kept up with their other writing major\nrequirements may apply to the honors program. Applications are submitted early in spring\nquarter of junior year. Over fall and winter of the senior year, admitted students enroll in\nENGLISH 399-0 Independent Study and work one on one with a faculty mentor to\ncomplete a signiﬁcant writing, creative media, or literary translation work (ENGLISH\n399-0 does not count toward requirements for the major). Students whose projects and\ngrades meet department criteria are recommended to the college for graduation with\nhonors. For more information see the director of creative writing or a creative writing\nadviser, visit the department website, and see Honors in the Major.\n"
    },
    {
        "Course Title": "The Based Minor",
        "Description": "\nStudents may apply to sequence-based minor in creative writing. Admission to the\nsequence-based minor in creative writing is competitive, based on a manuscript of\ncreative work from ENGLISH 206-0 Reading & Writing Poetry, ENGLISH 207-0 Reading\nand Writing Fiction, or ENGLISH 208-0 Reading & Writing Creative Non-Fiction. The\nminor offers an apprenticeship in the writing of poetry, ﬁction, and creative nonﬁction,\nwith a literature component.\n\nThe department accepts applications to the sequence-based minor in creative writing\nearly each spring. First-year students may not apply.\n\nCourse List\nCourseTitle"
    },
    {
        "Course Title": "The based Minor",
        "Description": "\n3 introductory courses:\nENGLISH 206-0\nReading & Writing Poetry\nENGLISH 207-0\nReading and Writing Fiction\nENGLISH 208-0\n\n\nReading & Writing Creative Non-Fiction\n1 yearlong theory and practice sequence:\nENGLISH 393-1\n& ENGLISH 393-2\n& ENGLISH 393-3 Theory and Practice of Poetry\nand Theory and Practice of Poetry\nand Theory and Practice of Poetry\nor ENGLISH 394-1\n& ENGLISH 394-2\n& ENGLISH 394-3 Theory & Practice of Fiction\nand Theory & Practice of Fiction\nand Theory & Practice of Fiction\nor ENGLISH 395-1\n& ENGLISH 395-2\n& ENGLISH 395-3 Theory and Practice of Creative Nonﬁction\nand Theory and Practice of Creative Nonﬁction\nand Theory and Practice of Creative Nonﬁction\n2 300-level English-department literature courses:\n1 on works written before 1830\n1 on works written after 1830\n\nIntroduction to Critical Theory\n"
    },
    {
        "Course Title": "The Critical Theory Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (6 units)\nCOMP_LIT 207-0/PHIL 220-0\n5 interdisciplinary 300-level courses approved by the program, including at least 1 course\nin each of three generally deﬁned ﬁelds:\nliterary theory\npolitical theory\nphilosophy\nA list of approved courses may be obtained from the program director or on the program\nwebsite prior to registration. Students may petition the director of undergraduate studies\nto count courses not listed or to substitute 1 200-level course for a 300-level course.\n"
    },
    {
        "Course Title": "The Dance Major",
        "Description": "\nhttps://communication.northwestern.edu/academics/theatre/undergraduate-programs/m\najor-dance.html\n\n\nThe Department of Theatre also offers a major in dance.\n\nThe dance major prepares students for further advanced academic work or a wide range\nof positions in the dance ﬁeld. The major’s comprehensive curriculum emphasizes the\nstudy of dance as well as the act of dancing, providing students with robust opportunities\nfor writing, research, and analysis in the ﬁeld, in addition to the study of dance techniques\nand choreography. The program supports a number of dance organizations, and offers\nmany performing opportunities.\n\nThe primary principle that undergirds the dance major is a belief that movement is the\nfoundation for liberatory possibility. The study of dance within the liberal arts context\nallows students to connect with their bodies, and think critically and creatively about the\nworld they live in through their bodies and dance-making practices. Students’ other\ninterdisciplinary ﬁelds of study are incorporated into a holistic understanding of what it\nmeans to be a thinking-feeling individual in community with others. In both studies and\nstudio settings, students ultimately cultivate creative collectivity through an awareness of\ncritical difference and are prepared intellectually and artistically for lifetime involvement\nin the ﬁeld.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nMajor Requirements (14 units)\nAll courses for SoC majors, minors, ﬁelds of concentration and distribution requirements\nmust be completed with a grade of C- or higher and may not be taken P/N.\n\nSoC Courses (1 unit)\n2 0.5-unit seminars:\n\nCourse List\nCourseTitle\nCMN 101-0 SoC First Year Seminar: Interdisciplinary Topics in Communication Arts &\nSciences\nCMN 398-0 School of Communication Senior Seminar\nIntroductory Courses (3 units)\nCourse List\nCourseTitle\nDANCE 101-1\n\nIntroduction to Dance Studies\n\n\nDance as Creative Collaboration\nDance Composition\n\nDANCE 101-2\nDANCE 225-0\nDance Technique Courses (3 units)\nA minimum of 3 units from the following list (each dance technique class carries .34 units;\n3 classes add up to 1.02 unit of credit). Each unit of technique must be taken in a chosen\ndance category (e.g., 3 classes in Modern/Contemporary, 3 classes in Basic Theatrical\nDance, etc.). Classes need not be taken at the same level or in any particular order;\nstudents are free to choose which technique categories they study.\n\nEXPAND ALL\nGeneral Technique Courses\nMusic Theatre Dance\nBasic Theatrical Dance\nModern/Contemporary\nDances of the African Diaspora\nJump Rhythm\nClassical Dance\nJazz Dance\nAdditional Dance Courses (7 Units)\nAt least 6 courses chosen from the following options, plus 1 enrollment in DANCE 399-0\nIndependent Study during senior year:\n\nFull-Credit Dance Courses\nAdditional Requirements (28 units)\nDistribution Requirements (18 units)\n18 units of credit outside the school, including 8 units of credit from the School of\nCommunication distribution areas: 2 from science, mathematics, and technology; 3 from\nindividual and social behavior; and 3 from humanities and ﬁne arts. In addition, 3 courses\nmust be at the 200 level or above, and 3 courses must be at the 300 level or above.\n\nElectives (10 units)\nElectives in communication and other areas to complete a minimum of 42 units of credit.\n\nHonors in Dance\nThe Dance Program encourages students who have demonstrated academic excellence in\nthe dance major to participate in the Senior Honors Program. Students work closely with a\nfaculty member to design, execute and present a research project that delves into the\nstudy of Dance. Contact the Dance Program for more information on eligibility and\nrequirements.\n\n"
    },
    {
        "Course Title": "The Dance Minor",
        "Description": "\nhttps://communication.northwestern.edu/academics/theatre/undergraduate-programs/m\ninor-dance.html\n\nThe dance minor offered by the Department of Theatre introduces students to many\nareas of study within the dance world, as well as providing abundant opportunities to\ncontribute to the ﬁeld. Students have the opportunity to explore dance studies, writing\nand analysis, in addition to dance techniques and performance.\n\nAll students are eligible for this minor, as space allows.\n\nAdmission to the minor is by application. Applications are available in winter quarter so\nthat students may begin the minor in spring quarter. Students must demonstrate\nacademic progress beyond technique study within the ﬁrst full year of enrollment in the\nminor.\n\nMinor Requirements (6.68 units)\nAll courses for SoC majors, minors, ﬁelds of concentration and distribution requirements\nmust be completed with a grade of C- or higher and may not be taken P/N.\n\nA maximum of the equivalent of 2 non-Northwestern academic units can count towards\nan SoC minor.\n\nIntroduction to Dance Studies\nDance as Creative Collaboration\nDance Composition\n\nCore courses (3 units):\nCourse List\nCourseTitle\nDANCE 101-1\nDANCE 101-2\nDANCE 225-0\nTechnique Courses (1.68 units)\nA minimum of 1.68 units from the following list (each dance technique class carries .34\nunits; 3 classes add up to 1.02 unit of credit). One full unit of technique (3 classes) must be\ntaken in a chosen dance category (e.g., 3 classes in Modern/Contemporary, 3 classes in\nBasic Theatrical Dance, etc.). The other .68 units can be from any category. Classes need\nnot be taken at the same level or in any particular order; students are free to choose which\ntechnique categories they study.\n\nEXPAND ALL\nGeneral Technique Courses\n\n\nMusic Theatre Dance\nBasic Theatrical Dance\nModern/Contemporary\nDances of the African Diaspora\nJump Rhythm\nClassical Dance\nJazz Dance\nDance Elective Courses (2 units)\n2 full-credit electives reﬂecting the student’s special interests (a dance technique\nsequence may not be used to satisfy this requirement).\n\nDance Elective List\n"
    },
    {
        "Course Title": "The Data Science and Engineering Minor",
        "Description": "\nThe Data Science and Engineering minor requires 8 courses: 4 core courses, 2 studio\ncourses, and 2 elective courses. No more than 4 courses may be double counted within a\nstudent's 21-unit major program. Courses with a grade lower than “C-” cannot be applied\nto the minor.\n\nUncertainty Analysis\n\nIntroduction to Biomedical Statistics\n\nCore courses (4 units):\nCourse List\nCourseTitle\nStatistics Foundations (1 course)\nBMD_ENG 220-0\nCHEM_ENG 312-0 Probability and Statistics for Chemical Engineering\nCIV_ENV 306-0\nIEMS 201-0 Introduction to Statistics\nIEMS 303-0 Statistics\nCourse List\nCourseTitle\n Programming Foundations (1 course)\nCOMP_SCI 150-0\nCOMP_SCI 211-0\nCourse List\nCourseTitle\nIntermediate Programming/Algorithmic Skills (1 course)\nCOMP_SCI 214-0 Data Structures & Algorithms\nCOMP_SCI 217-0 Data Management & Information Processing\nCourse List\n\nFundamentals of Computer Programming 1.5\nFundamentals of Computer Programming II\n\n\nBiomedical Applications in Machine Learning\n\nCourseTitle\nApplied Machine Learning (1 course)\nCOMP_SCI 349-0 Machine Learning\nELEC_ENG 375-0 Machine Learning: Foundations, Applications, and Algorithms\nIEMS 304-0 Statistical Learning for Data Analysis\nData Science Studio Courses (2 units):\nCourse List\nCourseTitle\nDATA_ENG 200-0 Foundations of Data Science\nDATA_ENG 300-0 Data Engineering Studio\nElective Courses (2 units):\nCourse List\nCourseTitle\nBMD_ENG 311-0 Computational Genomics\nBMD_ENG 312-0\nBMD_ENG 313-0 Wearable Devices: From Sensing to Biomedical Inference\nCHEM_ENG 379-0 Computational Biology: Analysis and Design of Living Systems\nCIV_ENV 304-0\nCIV_ENV 377-0\nCIV_ENV 480-1\nCIV_ENV 480-2\nCIV_ENV 495-0\nTransportation and Urban Infrastructure Applications)\nCOMP_SCI 348-0\nCOMP_SCI 394-0 Agile Software Development\nCOMP_SCI 396-0\nInformation Visualization) or (Computing, Ethics, and Society) or (Visualization for\nScientiﬁc Communication )\nCOMP_SCI 397-0\nSoftware Innovation)\nELEC_ENG 328-0\nELEC_ENG 335-0 Deep Learning Foundations from Scratch\nELEC_ENG 373-0 Deep Reinforcement Learning\nELEC_ENG 395-0\nMachine Learning and Deep Learning)\nELEC_ENG 424-0 Distributed Optimization\nELEC_ENG 433-0\nES_APPM 345-0\nES_APPM 375-1\n\nCivil and Environmental Engineering Systems Analysis\nChoice Modelling in Engineering\nTravel Demand Analysis & Forecasting 1\nAdvances in Travel Demand Analysis and Forecasting\nSelected Topics in Civil Engineering (Data Analytics for\n\nStatistical Pattern Recognition\nApplied Linear Algebra\nQuantitative Biology I: Experiments, Data, Models, and Analysis\n\nSpecial Projects in Computer Science (Rapid Prototyping for\n\nIntroduction to Artiﬁcial Intelligence\n\nInformation Theory & Learning\n\nSpecial Topics in Computer Science (Deep Learning) or (Interactive\n\nSpecial Topics in Electrical Engineering (Optimization Techniques for\n\n\nQuantitative Biology II: Experiments, Data, Models, and Analysis\nIntroduction to the Analysis of RNA Sequencing Data\nData Driven Methods for Dynamical Systems\n\nES_APPM 375-2\nES_APPM 472-0\nES_APPM 479-0\nIEMS 307-0 Quality Improvement by Experimental Design\nIEMS 308-0 Data Science and Analytics\nIEMS 313-0 Foundations of Optimization\nIEMS 340-0 Qualitative Methods in Engineering Systems\nIEMS 341-0 Social Networks Analysis\nIEMS 351-0 Optimization Methods in Data Science\nModeling and Simulation in Materials Science and Engineering\nMAT_SCI 358-0\nMAT_SCI 391-0\nProcess Design\nMECH_ENG 301-0 Introduction to Robotics Laboratory\nMECH_ENG 329-0 Mechanistic Data Science for Engineering\nMECH_ENG 341-0 Computational Methods for Engineering Design\nMECH_ENG 441-0 Engineering Optimization for Product Design and Manufacturing\nMECH_ENG 469-0 Machine Learning and Artiﬁcial Intelligence for Robotics\nMECH_ENG 495-0 Selected Topics in Mechanical Engg (Sensory Navigation and\nMachine Learning for Robotics)\n"
    },
    {
        "Course Title": "The Data Science Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n"
    },
    {
        "Course Title": "The Requirements for the Data Science Major",
        "Description": "\nDepartment Courses (11 units)\nRelated Courses (may be double-counted with another major, or with a minor)\nRelated courses in mathematics (units vary). MUST be taken EARLY in the program of\nstudy; includes prerequisite courses for required department courses.\nRelated courses in technical and domain science electives (2 units)\nRelated ethics course (1 unit)\nFor details see course lists, below.\n\nDepartment Courses\nCourse List\n\n\nCourseTitle\nDepartment Courses (see course descriptions for prerequisites in mathematics)\n4 foundational courses:\nSTAT 201-0\nIntroduction to Programming for Data Science\nor COMP_SCI 110-0\nIntroduction to Computer Programming\n(students who do not take STAT 201-0 are responsible for independently learning content\nnot covered in alternative course) 1\nSTAT 202-0\nIntroduction to Statistics and Data Science\nor STAT 210-0\nIntroduction to Probability and Statistics\nor STAT 232-0\nApplied Statistics\nor approved introductory statistics course from another department\nSTAT 320-1\nStatistical Theory & Methods 1\nor STAT 383-0\nProbability and Statistics for ISP\nor MATH 310-1\nProbability and Stochastic Processes\nor MATH 311-1\nMENU: Probability and Stochastic Processes\nor MATH 314-0\nProbability and Statistics for Econometrics\nor MATH 385-0\nProbability and Statistics for MMSS\nor ELEC_ENG 302-0\nProbabilistic Systems\nor IEMS 302-0\nProbability\n(students who do not take STAT 320-1 are responsible for independently learning content\nnot covered in alternative course) 1\nSTAT 320-2\nStatistical Theory & Methods 2\n6 data science core courses:\nSTAT 301-1\n& STAT 301-2\n\n\n& STAT 301-3\nData Science 1 with R\nand Data Science 2 with R\nand Data Science 3 with R\nor\nSTAT 303-1\n& STAT 303-2\n& STAT 303-3\nData Science 1 with Python\nand Data Science 2 with Python\nand Data Science 3 with Python\nNOTE! Students may receive credit for only one Data Science sequence: either Data\nScience with R (301 sequence), or Data Science with Python (303 sequence)\nSTAT 304-0\nData Structures and Algorithms for Data Science\nor COMP_SCI 214-0\nData Structures & Algorithms\nSTAT 305-0\nInformation Management for Data Science\nor COMP_SCI 217-0\nData Management & Information Processing\nSTAT 362-0\nAdvanced Machine Learning for Data Science\n1 capstone experience course:\nSTAT 390-0\nData Science Project\n1\nLists of topics not covered in substitute courses can be found on the department website.\n\nRelated Course Requirement\nThree types of related courses are required.\n\nRelated Courses - mathematics\nMathematics courses (units depend on mathematics sequence taken). MUST be taken\nEARLY in the program of study; includes prerequisite courses for required department\ncourses.\n\nCourse List\nCourseTitle\n\n\nSee course descriptions for prerequisite sequencing of mathematics related courses\nMATH 220-1\n& MATH 220-2\nSingle-Variable Differential Calculus\nand Single-Variable Integral Calculus\nor MATH 218-1\n& MATH 218-2\n& MATH 218-3\nSingle-Variable Calculus with Precalculus\nand Single-Variable Calculus with Precalculus\nand Single-Variable Calculus with Precalculus\nMATH 230-1\nMultivariable Differential Calculus\nor MATH 228-1\nMultivariable Differential Calculus for Engineering\nor MATH 281-1\nAccelerated Mathematics for ISP: First Year\nor MATH 285-2\nAccelerated Mathematics for MMSS: First Year\nor MATH 290-2\nMENU: Linear Algebra and Multivariable Calculus\nor MATH 291-2\nMENU: Intensive Linear Algebra and Multivariable Calculus\nMATH 226-0\n& MATH 230-2\nSequences and Series\nand Multivariable Integral Calculus\nor STAT 228-0\nSeries and Multiple Integrals\nor MATH 235-0\nSeries and Multiple Integrals\nor MATH 226-0\n& MATH 228-2\nSequences and Series\nand Multivariable Integral Calculus for Engineering\nor MATH 226-0\n& MATH 281-2\nSequences and Series\nand Accelerated Mathematics for ISP: First Year\n\n\nor MATH 226-0\n& MATH 285-3\nSequences and Series\nand Accelerated Mathematics for MMSS: First Year\nor MATH 226-0\n& MATH 290-3\nSequences and Series\nand MENU: Linear Algebra and Multivariable Calculus\nor MATH 226-0\n& MATH 291-3\nSequences and Series\nand MENU: Intensive Linear Algebra and Multivariable Calculus\nMATH 240-0\nLinear Algebra\nor MATH 281-3\nAccelerated Mathematics for ISP: First Year\nor MATH 285-1\nAccelerated Mathematics for MMSS: First Year\nor MATH 290-1\nMENU: Linear Algebra and Multivariable Calculus\nor MATH 291-1\nMENU: Intensive Linear Algebra and Multivariable Calculus\nor GEN_ENG 205-1\nEngineering Analysis I\nRelated Courses - technical and domain science electives (students choose 2 courses; may\nbe from different subject areas)\nFor updates please refer to department website list of Technical and Domain Science\nElectives. Some courses may have prerequisites; check course descriptions for details.\n\nEXPAND ALL\nAnthropology\nBiological Sciences\nBiomedical Engineering\nChemical and Biological Engineering\nCommunication\nComputer Science\nEarth and Planetary Science\nEconomics\nEngineering Sciences and Applied Mathematics\n\n\nGeography\nGlobal Health\nIndustrial Engineering and Management Sciences\nIntegrated Marketing and Journalism\nLinguistics\nMathematics\nMusic Theory\nPolitical Science\nPsychology\nSociology\nStatistics and Data Science\nRelated Courses - ethics elective (students choose 1 course)\nFor updates please refer to department website list of Ethics Electives. Some courses may\nhave prerequisites; check course descriptions for details.\n\nEXPAND ALL\nBlack Studies\nEntrepreneurship\nGlobal Health\nHumanities\nIntegrated Marketing and Journalism\nLatina and Latino Studies\nPerformance Studies\nPhilosophy\nPolitical Science\nReligious Studies\nSlavic Languages and Literatures\nSociology"
    },
    {
        "Course Title": "The Data Science Major with Additional Majors or Minor",
        "Description": "\nThe major in Data Science fulﬁlls the Weinberg College requirement of completion of a\nmajor, but it also can be completed alongside another major, or with a minor. The general\nWeinberg College policies apply to such combinations. Below is clarifying text about how\nthis works with certain combinations, and where particular exceptions to general rules are\napproved.\n\nThe Data Science Major for Students in the Integrated Science Program\nStudents complete all requirements for the ISP major, and the requirements for Data\nScience major are modiﬁed as follows:\n\n\nIntroductory Statistics course requirement (STAT 202-0, STAT 210-0, STAT 232-0 or\nequivalent) is waived\nMATH 226-0 is waived\nSTAT 383-0 Probability and Statistics for ISP counts in place of STAT 320-1\nThe 2 related Technical and Domain electives are automatically fulﬁlled by MATH 381-0\nFourier Analysis and Boundary Value Problems for ISP and EARTH 350-0 Physics of the\nEarth for ISP\nAll other data science major course requirements remain the same.\n\nThe Data Science Major for Students in the Mathematical Methods in the Social Sciences\nProgram\nStudents majoring in both Data Science and the adjunct major Mathematical Methods in\nthe Social Sciences (MMSS) need to complete all requirements for the MMSS major, and\nrequirements for Data Science major are modiﬁed as follows (for triple major limitations\nsee MMSS Adjunct Major):\n\nIntroductory Statistics course requirement (STAT 202-0, STAT 210-0, STAT 232-0 or\nequivalent) is waived\nMATH 226-0 is waived\nMATH 385-0 Probability and Statistics for MMSS counts in place of STAT 320-1\nThe 2 related Technical and Domain electives are automatically fulﬁlled by MATH 386-1\nEconometrics for MMSS and MATH 386-2 Econometrics for MMSS\nAll other data science major course requirements remain the same.\n"
    },
    {
        "Course Title": "The Data Science Major for Students Major",
        "Description": "\nFor students who complete all requirements for Statistics major, the requirements for the\nData Science major are modiﬁed as follows:\n\nIntroductory Programming course requirement (STAT 201-0 or COMP_SCI 110-0 will be\nreplaced with an additional 300-level STAT approved elective course. Statistics + Data\nScience majors take 4, 300-level STAT electives from the approved electives list for the"
    },
    {
        "Course Title": "The see Statistics Major",
        "Description": "\nIntroductory Statistics course requirement (STAT 202-0, STAT 210-0, STAT 232-0, or\nequivalent) is waived\nThe 2 related Technical and Domain electives are automatically fulﬁlled by STAT 320-3\nStatistical Theory & Methods 3 and STAT 350-0 Regression Analysis\nSTAT 320-1 and STAT 320-2 are replaced with 2 elective courses approved by the\nDirector of Data Science. The 2 elective courses designated as the replacements may not\nbe double counted with any other major/minor.\n\n\nNote that there can be no double counting between the 300 level elective courses\nrequired for the Statistics major and the required Data Science major courses including\nthe elective courses designated as the STAT 320-1 and STAT 320-2 replacements.\n\nAll other Data Science major course requirements remain the same.\n"
    },
    {
        "Course Title": "The Data Science Major for Students Minor",
        "Description": "\nStudents complete all requirements for Statistics minor and requirements for Data\nScience major are modiﬁed as follows:\n\nIntroductory Programming course requirement (STAT 201-0 or COMP_SCI 110-0) is\nreplaced with a 300-level STAT elective course from the approved elective list for the\nStatistics major (see Statistics Major).\nIntroductory Statistics course requirement (STAT 202-0, STAT 210-0, STAT 232-0, or\nequivalent) is waived\nThe 2 related Technical and Domain electives are automatically fulﬁlled by STAT 320-3\nStatistical Theory & Methods 3 and STAT 350-0 Regression Analysis\nSTAT 320-1 and STAT 320-2 are replaced with 2 elective courses approved by the\nDirector of Data Science. The 2 elective courses designated as the replacements may not\nbe double counted with any other major/minor.\nAll other Data Science major course requirements remain the same.\n"
    },
    {
        "Course Title": "The Data Science Major for Students Completing the Weinberg College Major or Minor",
        "Description": "\nComputer Science\nFor students who complete all requirements for the Weinberg Computer Science major or\nminor, the requirements for the Data Science major are modiﬁed as follows:\n\nSTAT 304-0 will be replaced with 1 elective course approved by the Director of Data\nScience.\nAll other Data Science major course requirements remain the same.\n\nHonors in Data Science\nMajors with strong academic records and an interest in pursuing honors should contact\nthe Director of Data Science no later than the start of senior year. Accepted students take\n2 quarters of STAT 399-0 Independent Study, during which they develop and write a\nresearch paper; these enrollments do not count toward the major.\n\n\nStudents whose theses and grades meet department criteria are recommended to the\ncollege for graduation with honors. For more information consult the Director of Data"
    },
    {
        "Course Title": "The Science and see Honors in the Major",
        "Description": "\n\nStudents minoring in data science receive exposure to computational and applied\nstatistical techniques. This minor provides a strong foundation for graduate work and\nacademic preparation in the area.\n"
    },
    {
        "Course Title": "The Requirements for the Minor",
        "Description": "\nStudents take 2 foundational courses, 4 core courses (the 3 Data Science sequence\ncourses and Data Visualization (STAT 302-0)), and 1 approved elective. For details see\ncourse lists, below.\n\nCourse List\nCourseTitle\nMinor Requirements (7 units)\n2 foundational courses:\nSTAT 201-0\nIntroduction to Programming for Data Science\nor COMP_SCI 110-0\nIntroduction to Computer Programming\n(students who do not take STAT 201-0 are responsible for independently learning content\nnot covered in alternative course) 1\nSTAT 202-0\nIntroduction to Statistics and Data Science\nor STAT 210-0\nIntroduction to Probability and Statistics\nor STAT 232-0\nApplied Statistics\nor approved introductory statistics course from another department\n4 data science core courses:\nSTAT 301-1\n& STAT 301-2\n& STAT 301-3\nData Science 1 with R\nand Data Science 2 with R\nand Data Science 3 with R\nor\n\n\nSTAT 303-1\n& STAT 303-2\n& STAT 303-3\nData Science 1 with Python\nand Data Science 2 with Python\nand Data Science 3 with Python\nNOTE! Students may receive credit for only one Data Science sequence: either Data\nScience with R (301 sequence), or Data Science with Python (303 sequence)\nSTAT 302-0\nData Visualization\n1 approved elective course (see lists below)\n1\nLists of topics not covered in substitute courses can be found on the department website.\n\nCourses used to fulﬁll the requirements for the minor in data science may not be used to\nfulﬁll the requirements for another major/minor except where permitted by Weinberg\nCollege double-counting rules (see FAQ). When necessary (for example when a student\nplans to complete a major in statistics and a minor in data science), students can consult\nthe Director of Data Science in the Department of Statistics and Data Science about\nselection of replacement course(s) to satisfy the credit requirements of the data science\nminor.\n"
    },
    {
        "Course Title": "The Approved Elective Courses for the Data Science Minor",
        "Description": "\nStudents choose 1 course from any of the ﬁelds below. For updates please refer to"
    },
    {
        "Course Title": "The department website list of Data Science Minor",
        "Description": "\nhave prerequisites; check course descriptions for details.\n\nEXPAND ALL\nAnthropology\nBiological Sciences\nBiomedical Engineering\nChemical Engineering\nCognitive Science\nCommunication Studies\nComputer Engineering\nComputer Science\nEarth and Planetary Science\nEconomics\nElectrical Engineering\n\n\nEngineering Sciences and Applied Mathematics\nGeography\nGlobal Health Studies\nIndustrial Engineering and Management Sciences\nIntegrated Marketing Certiﬁcate\nJournalism\nLinguistics\nMathematics\nMusic Theory\nPolitical Science\nPsychology\nSchool of Education and Social Policy\nSociology\nStatistics and Data Science"
    },
    {
        "Course Title": "The Data Science Minor in Relation to Major",
        "Description": "\nThe minor in Data Science can be completed along with any major. The general Weinberg\nCollege policies about major/minor pairings apply. Below is clarifying text about how this\nworks with certain majors, and where particular exceptions to general rules are approved.\n\nThe Data Science Minor for Students in the Integrated Science Program\nStudents complete all requirements for the ISP major, and requirements for Data Science\nminor are modiﬁed as follows:\n\nIntroductory Statistics course requirement: STAT 202-0, STAT 210-0, STAT 232-0 or\nequivalent is waived\nAll other Data Science minor requirements must be met.\n\nThe Data Science Minor for Students in the Mathematical Methods in the Social Sciences\nProgram\nStudents will complete all requirements for the MMSS adjunct major, and requirements\nfor Data Science minor are modiﬁed as follows:\n\nIntroductory Statistics course requirement: STAT 202-0, STAT 210-0, STAT 232-0 or\nequivalent is waived\nAll other Data Science minor requirements must be met.\n"
    },
    {
        "Course Title": "The Data Science Minor with the Major",
        "Description": "\nStudents complete all requirements for Statistics major, and requirements for Data\nScience minor are modiﬁed as follows:\n\n\nSTAT 201-0 (or COMP_SCI 110-0) is replaced with another approved course. In most\ncases, an introductory calculus course that is necessary for the Statistics major will be\nused as the replacement.\nSTAT 202-0, STAT 210-0, STAT 232-0 or equivalent is replaced with another approved\ncourse. In most cases, an introductory calculus course that is necessary for the Statistics\nmajor will be used as the replacement.\nNote: STAT 301-1,2,3 (Data Science with R), STAT 303-1,2,3 (Data Science with Python),\nand any 300-level electives being used for the Data Science minor cannot be used to fulﬁll\ncredit requirements for the Statistics major.\n\nAll other Data Science minor requirements must be met.\n"
    },
    {
        "Course Title": "The Earth and Planetary Sciences Major",
        "Description": "\nThe academic program aims to cover the breadth of geologic sub-disciplines, hone the\nskills necessary to succeed in Earth Science careers, and allow for choice based on student\ninterests. Courses may include theory, descriptive studies, data analysis, computer\nmodeling, laboratory exercises, and ﬁeld training.\n\nStudents are encouraged to take the 200-level foundation courses as early as possible, but\nthey need not be taken in sequence.\n\nStudents planning to attend graduate school are strongly encouraged to conduct\nindependent study (EARTH 399-0).\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nMajor Requirements: Department Courses (12 Units)\n4 200-level Core EARTH Courses (4 units)\nCourse List\nCourseTitle\nEARTH 201-0\nEARTH 202-0\n\nEarth Systems Revealed\nEarth's Interior\n\n\nEarth System History\nEARTH 203-0\nEARTH 204-0\nCommunication for Geoscientists\n8 300-level Advanced Studies EARTH Courses (8 units)\nAdvanced studies courses are divided into seven sub-disciplines and three skill areas, as\nlisted below. Students must take at least one course from four of the seven Sub-Discipline\nRequirement lists below, and at least one course from each of the three Skills\nRequirement lists below. Additional advanced studies courses to the required total of\neight may be any EARTH 300- or 400-level course, but only one EARTH 399-0\nIndependent Study may be counted toward the major. Consult with the Director of\nUndergraduate Studies (DUS) regarding EARTH 390-0 Special Topics in Earth and\nPlanetary Science courses that may meet Sub-Discipline or Skills requirements. In certain\ncases, the DUS may approve additional eligible courses for the Sub-Discipline and Skills\nRequirement course lists.\n\nSub-Discipline Requirement (4 courses)\nStudents must take at least one course from four of the following seven sub-disciplines.\n\nEXPAND ALL\nEarth Materials\nGeochemistry\nSeismology\nGeology\nClimate/Paleoclimate\nGeophysics\nGeobiology\nSkills Requirement (3 courses)\nStudents must take at least one course from each of the following three skill areas. No\ncourse may be counted in more than one skills category. Some topic offerings of EARTH\n390-0 may be applied to a skill area with department approval; see department website\nfor updates.\n\nEXPAND ALL\nQuantitative\nSpatial Reasoning\nAnalytical/Instrumentation/Field\nMajor Requirements: Related Courses (9.34-12.04 Units)\nMath Courses (3-4 courses)\n\n\nStudents must take the following math requirements, for a total of three units if the\nMATH 220 sequence is selected, or a total of four units if the MATH 218 sequence is\nselected.\n\nSingle-Variable Differential Calculus\n\nCourse List\nCourseTitle\nMATH 220-1\n& MATH 220-2\nand Single-Variable Integral Calculus\nor MATH 218-1\n& MATH 218-2\n& MATH 218-3\nand Single-Variable Calculus with Precalculus\nand Single-Variable Calculus with Precalculus\nMATH 226-0 Sequences and Series\nor MATH 230-1\nor MATH 240-0\nor equivalent\n6 Additional Related Math and Science Courses\nStudents must take six courses (and their associated lab, if applicable) from the following\noptions, with maximum three in any one subject.1\n\nMultivariable Differential Calculus\nLinear Algebra\n\nSingle-Variable Calculus with Precalculus\n\nFundamentals of Chemistry I\n\nFundamentals of Chemistry II\n\nCourse List\nCourseTitle\nCHEM 131-0\n& CHEM 141-0\nand Fundamentals of Chemistry Laboratory I\nCHEM 132-0\n& CHEM 142-0\nand Fundamentals of Chemistry Laboratory II\nCHEM 151-0\n& CHEM 161-0\nand General Chemistry Laboratory I\nCHEM 152-0\n& CHEM 162-0\nand General Chemistry Laboratory II\nCHEM 171-0\n& CHEM 181-0\nand Advanced General Inorganic Chemistry Laboratory\n\nGeneral Chemistry II\n\nGeneral Chemistry I\n\nAdvanced General Inorganic Chemistry\n\n\nOrganic Chemistry I\n\nOrganic Chemistry II\n\nOrganic Chemistry III\n\nAdvanced General Physical Chemistry\n\nCHEM 172-0\n& CHEM 182-0\nand Advanced General Physical Chemistry Laboratory\nCHEM 215-1\n& CHEM 235-1\nand Organic Chemistry Lab I\nCHEM 215-2\n& CHEM 235-2\nand Organic Chemistry Lab II\nCHEM 215-3\n& CHEM 235-3\nand Organic Chemistry Lab III\nPHYSICS 135-1\n& PHYSICS 136-1 General Physics\nand General Physics Laboratory\nPHYSICS 135-2\n& PHYSICS 136-2 General Physics\nand General Physics Laboratory\nPHYSICS 135-3\n& PHYSICS 136-3 General Physics\nand General Physics Laboratory\nBIOL_SCI 201-0\nBIOL_SCI 202-0\n& BIOL_SCI 232-0 Cell Biology\nand Molecular and Cellular Processes Laboratory\nBIOL_SCI 203-0\n& BIOL_SCI 233-0 Genetics and Evolution\nand Genetics and Molecular Processes Laboratory\nMATH 226-0 Sequences and Series\nMATH 230-2 Multivariable Integral Calculus\nor MATH 228-2\nMATH 240-0 Linear Algebra\nMATH 250-0 Elementary Differential Equations\n1\nNote: Introductory Chemistry, Physics, Biology, and Math courses may be offered in\nparallel tracks. Consistent with restrictions at the University level, a student cannot\nreceive credit for some course sequences if credit has already been awarded for an\nequivalent course. See Chemistry, Physics, Biology, and Math sections of this Catalog for\ndetails.\n\nMultivariable Integral Calculus for Engineering\n\nMolecular Biology\n\n\nHonors in Earth and Planetary Sciences\nMajors with strong academic records and an interest in pursuing honors should discuss\npossible research projects with a faculty member and/or the director of undergraduate\nstudies (DUS) early in their undergraduate career, but no later than spring quarter of their\njunior year. After the chosen faculty mentor approves a proposed project, research is\nconducted and students must complete at least two quarters of EARTH 399-0\nIndependent Study; only one quarter may count towards major requirements. To earn the\nhonors distinction, students must complete a thesis following the guidance provided in\nguidelines published on the department webpage.\n\nStudents whose grades, research, and written thesis meet departmental criteria are\nrecommended to the college for graduation with honors. For more information, students"
    },
    {
        "Course Title": "The should consult the director of undergraduate studies and see Honors in the Major",
        "Description": "\n"
    },
    {
        "Course Title": "The Earth and Planetary Sciences Minor",
        "Description": "\nThe minor offers students in any major outside the department a ﬂexible path to improved\nknowledge of earth and planetary sciences.\n\nMinor Requirements (6 units)\nTwo courses from EARTH 201-0, EARTH 202-0, or EARTH 203-0.\n\nFour 300-level EARTH courses, of which only one EARTH 399-0 or 400-level course may\nbe substituted with permission from the Director of Undergraduate Studies.\n"
    },
    {
        "Course Title": "The Economics Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nThe introductory courses ECON 201-0 Introduction to Macroeconomics and ECON\n202-0 Introduction to Microeconomics must be taken ﬁrst and in that order. STAT 210-0\nIntroduction to Probability and Statistics and MATH 220-1 Single-Variable Differential\nCalculus should also be taken early in the program; the former is a prerequisite for ECON\n281-0 Introduction to Applied Econometrics and the latter for ECON 310-1\n\n\nMicroeconomics. ECON 281-0 and the intermediate theory courses should be completed\nbefore 300-level ﬁeld courses are taken. Although only MATH 220-1 is required, majors\nare strongly urged to take MATH 220-2 Single-Variable Integral Calculus, MATH 230-1\nMultivariable Differential Calculus, and MATH 240-0 Linear Algebra . Majors considering\ngraduate work in economics are strongly advised to take additional mathematics courses\nand perhaps a second major in mathematics. Students wishing to pursue in-depth study of\neconometrics may take the advanced econometrics courses ECON 381-1 and ECON\n381-2 without taking introductory econometrics ECON 281-0 ﬁrst. For students who\ncomplete ECON 381-1, ECON 281-0 will be waived.\n\nCourse List\nCourseTitle\nDepartment Courses (12 units)\n3 introductory courses:\nECON 201-0\nIntroduction to Macroeconomics\nECON 202-0\nIntroduction to Microeconomics\nECON 281-0\nIntroduction to Applied Econometrics\n3 intermediate theory courses:\nECON 310-1\nMicroeconomics\nECON 310-2\nMicroeconomics\nECON 311-0\nMacroeconomics\n6 additional ﬁeld courses at the 300 level\nRelated Courses\nMATH 220-1 Single-Variable Differential Calculus 1\nor MATH 218-2\nSTAT 210-0 Introduction to Probability and Statistics 2\nor MATH 314-0\n1\nA math course at a higher level than MATH 220-1 may be applied instead. MATH 220-1\n(or higher) credit granted based on AP or IB testing may be applied.\n\nProbability and Statistics for Econometrics\n\nSingle-Variable Calculus with Precalculus\n\n2\n\n\nSTAT 210-0 credit based on AP or IB test may be applied. MATH 385-0 or equivalent\ncourse may be applied.\n"
    },
    {
        "Course Title": "The Joint Major",
        "Description": "\nIn addition to taking all of the required Mathematical Methods in the Social Sciences\ncourses, students must take the following in order to complete a joint major in economics\n(for triple major limitations see MMSS Adjunct Major).\n\nCourse List\nCourseTitle\nDepartment Courses (7 units)\n1 introductory course:\nECON 201-0\nIntroduction to Macroeconomics\n1 intermediate theory course:\nECON 311-0\nMacroeconomics\n5 additional ﬁeld courses at the 300 level. 1\n1\nThese courses can include ECON 310-2 Microeconomics, but cannot include ECON 380-1\nGame Theory, ECON 380-2 Game Theory, ECON 381-1 Econometrics, or ECON 381-2\nEconometrics.\n\nEconomics Major for Industrial Engineering"
    },
    {
        "Course Title": "The Students completing the Industrial Engineering Degree",
        "Description": "\neconomics with some industrial engineering courses double-counted towards both\nprograms of study as described below.\n\nCourse List\nCourseTitle\nSubstitute for introductory course ECON 281-0:\nIEMS 304-0\nStatistical Learning for Data Analysis\nCount as one of the six 300-level ﬁeld courses:\nIEMS 373-0\nIntro to Financial Engineering\nSubstitute for related course STAT 210-0:\nIEMS 303-0\nStatistics\n\n\nHonors in Economics\nBy invitation only, majors with strong academic records may pursue departmental honors\nby completing one of the following three options in addition to the regular requirements\nof the major: Senior Seminars ECON 398-1 and ECON 398-2, 2 quarters of ECON 399-0\nIndependent Study, or 2 400-level ﬁeld courses in economics. None of these courses\ncounts toward the major requirements. Under each option, candidates must submit a\nthesis presenting original research.\n\nStudents whose theses and grades meet department criteria are recommended to the\ncollege for graduation with honors. Interested students should consult with the director\nof undergraduate studies and see Honors in the Major.\n"
    },
    {
        "Course Title": "The Economics Minor",
        "Description": "\nThe minor offers training in economic theory through the intermediate level, instruction\nin quantitative methods of econometrics, and opportunity for advanced work in students’\nareas of interest. The introductory and inter mediate courses are the same as those in the\nmajor, except that only 2 of the intermediate theory courses are required (ECON 310-1\nMicroeconomics and either ECON 310-2 Microeconomics or ECON 311-0\nMacroeconomics). As in the major, MATH 220-1 Single-Variable Differential Calculus and\nSTAT 210-0 Introduction to Probability and Statistics must be taken early in the program\nbecause they are prerequisites for required courses. Students wishing to pursue in-depth\nstudy of econometrics may take advanced econometrics ECON 381-1 and ECON 381-2\nwithout taking introductory econometrics ECON 281-0 ﬁrst. For students who complete\nECON 381-1, ECON 281-0 will be waived.\n\nCourse List\nCourseTitle\nMinor Requirements (8 units)\n3 introductory courses:\nECON 201-0\nIntroduction to Macroeconomics\nECON 202-0\nIntroduction to Microeconomics\nECON 281-0\nIntroduction to Applied Econometrics\n2 intermediate theory courses:\nECON 310-1\nMicroeconomics\nECON 310-2\n\n\nMicroeconomics\nor ECON 311-0\nMacroeconomics\n3 additional ﬁeld courses at the 300 level\nEconomics Minor for Industrial Engineering\nStudents completing the Industrial Engineering Degree may double-count one industrial\nengineering course with the minor in economics as described below.\n\nCourse List\nCourseTitle\nSubstitute for introductory course ECON 281-0:\nIEMS 304-0\nStatistical Learning for Data Analysis\nOR\nCount as one of the three 300-level ﬁeld courses:\nIEMS 373-0\nIntro to Financial Engineering\n"
    },
    {
        "Course Title": "The Electrical Engineering Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore Courses (27 units)1\nCourse List\nCourseTitle\n4 mathematics courses\n4 units of basic science: 2\nPHYSICS 135-2\n& PHYSICS 136-2\nGeneral Physics\nand General Physics Laboratory\nPHYSICS 135-3\n& PHYSICS 136-3\nGeneral Physics\nand General Physics Laboratory\n1.33 units chosen from McCormick-approved basic science categories of Chemistry,\nPhysics, Biological Science, Earth & Planetary Science or Astronomy\n4 engineering analysis and computer proﬁciency courses\n\n\n3 design and communications courses\n7 social sciences/humanities courses\n5 unrestricted electives\nMajor Program (21 units)\nCourse List\nCourseTitle\n10 required courses\nCOMP_ENG 203-0\nIntroduction to Computer Engineering\nCOMP_SCI 211-0\nFundamentals of Computer Programming II\nor COMP_SCI 150-0\nFundamentals of Computer Programming 1.5\nELEC_ENG 202-0\nIntroduction to Electrical Engineering\nELEC_ENG 221-0\nFundamentals of Circuits\nELEC_ENG 222-0\nFundamentals of Signals & Systems\nELEC_ENG 223-0\nFundamentals of Solid State Engineering\nELEC_ENG 224-0\nFund of Electromagnetics & Photonics\nELEC_ENG 225-0\nFundamentals of Electronics\nELEC_ENG 302-0\nProbabilistic Systems\n1 additional McCormick course at 200-level or higher comprised of 100% Engineering\nTopics based on ABET Course Partitioning Table\n10 technical elective courses 3\n6 courses chosen from the technical elective tracks below\nBiomedical engineering track\nCircuits and electronics track\nCommunications systems track\nControl systems track\nSignal processing and machine learning track\nElectromagnetics and optics track\nSolid-state engineering track\n\n\n2 courses at the 300- or 400-level in COMP_SCI, ELEC_ENG, or COMP_ENG technical\nelectives (which may include COMP_ENG 205-0 and the courses above)\n2 courses chosen from the options below\n300-level technical courses in science, mathematics, computer science, or engineering or\nthe courses above\nBIOL_SCI 201-0\nMolecular Biology\nBIOL_SCI 202-0\nCell Biology\nBIOL_SCI 203-0\nGenetics and Evolution\nCHEM 215-1\n& CHEM 215-2\n& CHEM 215-3\nOrganic Chemistry I\nand Organic Chemistry II\nand Organic Chemistry III\n1 design course from the options below 4\nCOMP_ENG 347-1\nMicroprocessor Systems Project I\nCOMP_ENG 392-0\nVLSI Systems Design Projects\nELEC_ENG 327-0\nElectronic System Design II: Project\nELEC_ENG 398-0\nElectrical Engineering Design\nELEC_ENG 399-0\nProjects\n1\nSee general requirements for details.\n\n2\nPHYSICS 125-2 General Physics for ISP or PHYSICS 140-3 Fundamentals of Physics may\nbe substituted for PHYSICS 135-2 General Physics. PHYSICS 125-3 General Physics for\nISP or PHYSICS 140-3 Fundamentals of Physics may be substituted for PHYSICS 135-3\nGeneral Physics. Associated labs are PHYSICS 126-2 Physics for ISP Laboratory or\nPHYSICS 136-2 General Physics Laboratory and PHYSICS 126-3 Physics for ISP\nLaboratory or PHYSICS 136-3 General Physics Laboratory.\n\n\n3\nNo more than 2 units of ELEC_ENG 399-0 Projects will be counted as technical electives.\nAdditional units of ELEC_ENG 399-0 Projects may be taken but will be counted as\nunrestricted electives.\n\n4\nWhen ELEC_ENG 399-0 Projects is a design project and the student has senior standing\n\nTechnical Elective Tracks\nEXPAND ALL\nBiomedical Engineering Track\nCircuits and Electronics Track\nCommunications Systems Track\nControl Systems Track\nSignal Processing and Machine Learning Track\nElectromagnetics Engineering Track\nSolid-State Engineering Track\n"
    },
    {
        "Course Title": "The Elementary Teaching Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nFoundational Disciplines (10 units)\n2 natural sciences courses 1\n2 empirical and deductive reasoning courses2\n2 historical studies courses\n2 ethical and evaluative thinking courses\n2 literature and arts courses\nSelected courses from Weinberg College and professional schools across the University\nfulﬁll distribution requirements. A meeting with the student’s academic advisor is\nrequired prior to registering for distribution requirement courses.\n\n1\nPlease speak to academic advisor before choosing natural sciences courses to make sure\nelementary teaching licensure requirement is met. Please visit the Elementary Teaching\nExtension Courses guide for more information.\n\n2\n\n\nPlease speak to your academic advisor before choosing empirical and deductive reasoning\ncourses to make sure elementary teaching licensure requirement is met. Please visit the\nElementary Teaching Extension Courses guide for more information.\n\nSESP Core (8 units)\nCourse List\nCourseTitle\nSESP 200-0\nUnderstanding Knowledge\nSESP 201-0\nHuman Development: Childhood and Adolescence 3\nSESP 210-0\nIntroduction to Statistics and Research Methodology\nSESP 272-0\nField Research Methods\nTEACH_ED 387-0\nStudent Teaching: Elementary\n3\nSESP 201 has a few alternatives. SESP 351-0 Special Topics (Child and Adolescent\nDevelopment) and PSYCH 244-0 Developmental Psychology are both substitutions,\nhowever please note that PSYCH 110-0 Introduction to Psychology is a prerequisite for\nPSYCH 244-0.\n\nFoundations Courses (6 units)\nCourse List\nCourseTitle\nTEACH_ED 301-0\nSchooling in America\nTEACH_ED 302-0\nSocial, Cultural, and Linguistic Contexts of Education\nTEACH_ED 310-0\nFoundations of Learning in a New Language\nTEACH_ED 327-0\nEducating Exceptional Children\nTEACH_ED 322-0\nLinguistics Informed Approaches to Literacy\nTEACH_ED 377-0\n\n\nTheory & Practice of Teaching in Multiling. & Multicult. Contexts: Elementary\nConcentration Cluster Courses\nPlease visit the Elementary Teaching Extension Courses guide for more information.\nStudents will be notiﬁed by their advisor if there are any changes to this list.\n\nAll Elementary Teaching students take the following as a part of their cluster\nrequirements:\n\nSciences (3 units)\nOne from the Physical Science cluster, one from the Life Science cluster, and one from the\nEarth and Space Science cluster.\n\nSome courses will fulﬁll more than one cluster, but credit will only be applied once to one\ncluster. Students still need to complete 3 units, one in each cluster.\n\nPlease note that up to two science classes can be fulﬁlled by the Natural Science\nfoundational disciplines requirements if they fall into the following categories:\n\nCourse List\nCourseTitle\nPhysical Science\nCHEM 131-0\nFundamentals of Chemistry I\nCHEM 132-0\nFundamentals of Chemistry II\nCHEM 201-0\nChemistry of Nature and Culture\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-0\nThe Ocean, the Atmosphere & Our Climate\nEARTH 180-0\nFantasy Worlds – How to Build Your Own Planet\nEARTH 201-0\nEarth Systems Revealed\nEARTH 203-0\nEarth System History\nPHYSICS 103-0\nIdeas of Physics\n\n\nAny level Physics course; please speak with your advisor.\nLife Science\nBIOL_SCI 103-0\nDiversity of Life\nBIOL_SCI 109-0\nThe Nature of Plants\nBIOL_SCI 150-0\nHuman Genetics\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-0\nThe Ocean, the Atmosphere & Our Climate\nEARTH 203-0\nEarth System History\nENVR_SCI 201-0\nEarth: A Habitable Planet\nENVR_SCI 202-0\nThe Health of the Biosphere\nTEACH_ED 333-0\nScience Content for Teachers\nAny level Biological Sciences course; please speak with your advisor.\nEarth and Planetary Science\nASTRON 101-0\nModern Cosmology\nASTRON 102-0\nMilky Way Galaxy\nASTRON 103-0\nSolar System\nASTRON 120-0\nHighlights of Astronomy\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-0\nThe Ocean, the Atmosphere & Our Climate\nEARTH 180-0\nFantasy Worlds – How to Build Your Own Planet\nEARTH 201-0\nEarth Systems Revealed\nEARTH 203-0\n\n\nEarth System History\nTEACH_ED 333-0\nScience Content for Teachers\nMath and Statistics (1 unit)\nPlease note that this unit can be fulﬁlled by one of the Empirical and Deductive Reasoning\n(FD-EDR) foundational discipline requirements if the class is included in the following list:\n\nCourse List\nCourseTitle\nMATH 100-0 Quantitative Reasoning\nMATH 202-0 Finite Mathematics\nAny level Math course; please speak with your advisor.\nSTAT 210-0 Introduction to Probability and Statistics\nTEACH_ED 314-0 Math for Elementary Teachers\nTEACH_ED 318-0 Teaching Math: Geometry\nTEACH_ED 319-0 Teaching Math: Statistics and Probability\nTEACH_ED 373-0 Topics in High School Math\nSocial Sciences (2 units)\nCourse List\nCourseTitle\nTEACH_ED 334-0 Social Science Content for Teachers\nThe other unit can be fulﬁlled with any of the following:\n\nCourse List\nCourseTitle\nPOLI_SCI 220-CN American Government and Politics\nPOLI_SCI 230-CN Law in the Political Arena\nECON 201-0 Introduction to Macroeconomics\nECON 202-0 Introduction to Microeconomics\nMethods (4 units)\nCourse List\nCourseTitle\nTEACH_ED 311-0\nElementary Methods for Teaching Science and Social Studies I\nTEACH_ED 312-0\nElementary Methods for Teaching Science and Social Studies II\nTEACH_ED 323-0\nElementary Literacy Methods & Content\nTEACH_ED 326-0\n\n\nElementary Math: Methods and Content\nEquity and Education (3 Units)\nCourse List\nCourseTitle\nTEACH_ED 309-0\nSupporting Discourse in K-12 Classrooms\nLOC/LRN_SCI 214-0\nCulture and Cognition\nor LOC 214-BR\nCulture and Cognition: SESP Leadership Institute\nSESP 260-0\nCommunity Based Research Methodologies: Educational Justice\nTEACH_ED 324-0\nCritical Issues in Literacy\nTEACH_ED 328-0\nDynamics of Middle School Curriculum\nSESP 320-0\nRace and Education\nSESP 325-0\nRace, Adolescence, and School Discipline\nSESP 323-0\nTrauma and Atrocity: Holocaust Memory, Memorial and Museums\nSESP 360-0\nMagic Monsters & the Holocaust\nLRN_SCI 224-0\nHolocaust Education Design\nTEACH_ED 329-0\nCognition and Culture in Teaching and Learning\nLRN_SCI 301-0\nDesign of Learning Environments\nHDC 305-0\nIdentity and Motivation\nElectives (8 units)\nAdditional units of elective coursework must be taken to complete the 42-unit degree\nrequirement. Students are encouraged to discuss their elective plans with the teacher\ncertiﬁcation manager.\n\nAdditional Licensure Requirements (included in the degree's 42 units)\nHistory courses\n\n\nLiterature and arts courses\nPhysical Science, life science and earth/space science courses\n Please note that up to two science classes can be fulﬁlled by the Natural Science\nfoundational discipline requirements if they fall into the following categories:\nCourse List\nCourseTitle\nPhysical Science\nCHEM 131-0\nFundamentals of Chemistry I\nCHEM 132-0\nFundamentals of Chemistry II\nCHEM 201-0\nChemistry of Nature and Culture\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-0\nThe Ocean, the Atmosphere & Our Climate\nEARTH 180-0\nFantasy Worlds – How to Build Your Own Planet\nEARTH 201-0\nEarth Systems Revealed\nEARTH 203-0\nEarth System History\nPHYSICS 103-0\nIdeas of Physics\nAny level Physics course; please speak with your advisor.\nLife Science\nBIOL_SCI 103-0\nDiversity of Life\nBIOL_SCI 109-0\nThe Nature of Plants\nBIOL_SCI 150-0\nHuman Genetics\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-CN\nThe Ocean, the Atmosphere, and our Climate\nEARTH 203-0\nEarth System History\n\n\nENVR_SCI 201-0\nEarth: A Habitable Planet\nENVR_SCI 202-0\nThe Health of the Biosphere\nTEACH_ED 333-0\nScience Content for Teachers\nEarth and Planetary Science\nASTRON 101-0\nModern Cosmology\nASTRON 102-0\nMilky Way Galaxy\nASTRON 103-0\nSolar System\nEARTH 101-0\nEarth Science for the 21st Century\nEARTH 106-0\nThe Ocean, the Atmosphere & Our Climate\nEARTH 180-0\nFantasy Worlds – How to Build Your Own Planet\nEARTH 201-0\nEarth Systems Revealed\nEARTH 203-0\nEarth System History\nTEACH_ED 333-0\nScience Content for Teachers\nMath and statistics courses\n Please note that one of these classes can fulﬁlled by the Empirical and Deductive\nReasoning (FD-EDR) foundational discipline requirement if they fall into the following\ncategories:\nCourse List\nCourseTitle\nMATH 100-0 Quantitative Reasoning\nMATH 202-0 Finite Mathematics\nAny level Math course; please speak with your advisor.\nSTAT 210-0 Introduction to Probability and Statistics\nTEACH_ED 314-0 Math for Elementary Teachers\nTEACH_ED 318-0 Teaching Math: Geometry\nTEACH_ED 319-0 Teaching Math: Statistics and Probability\nTEACH_ED 373-0 Topics in High School Math\n\n\nMiddle Grade Endorsement (optional)\n7 courses in competency areas:\nScience\nEnglish\nSpanish\nMath\nSocial Science\n1 Middle Grades Methods and Techniques course:\nCourse List\nCourseTitle\nTEACH_ED 366-0 Middle Grades Methods & Techniques of Teaching: English\nTEACH_ED 367-0 Middle Grades Methods & Techniques of Teaching: Mathematics\nTEACH_ED 368-0 Middle Grades Methods & Techniques of Teaching: Science\nTEACH_ED 369-0 Middle Grades Methods & Techniques of Teaching: Social Sciences\n\nEnglish as a Second Language (ESL) and Bilingual Endorsement (optional)\nMost requirements for this endorsement are met through other course work in this\ndegree. To complete the endorsement students are encourages to take the following\ncourses:\nCourse List\nCourseTitle\nTEACH_ED 320-0 Designing for Linguistically and Culturally Sustaining Instruction\nTEACH_ED 332-0 Assessment of Linguistically Diverse Students\nor MS_ED 432-1\n& MS_ED 432-2\nand Assessment of Linguistically Diverse Students II\n\nAssessment of Linguistically Diverse Students I\n"
    },
    {
        "Course Title": "The English Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\n\n\nDepartment Courses (13 units)\n2 200-level Historical Breadth courses\n1 emphasizing works written before 1830\n1 emphasizing works written after 1830\n2 required seminars\nENGLISH 300-0\nSeminar in Reading and Interpretation\nENGLISH 397-0"
    },
    {
        "Course Title": "The Research Seminar for Literature Major",
        "Description": "\n9 additional literature courses\nAt least 7 courses must be at the 300-level; 2 courses may be taken at the 200-level\nAt least 3 courses emphasizing works written before 1830\nAt least 3 courses emphasizing works written after 1830\nAt least 1 course focusing on Gender, Sexuality & Embodiment\nAt least 1 course focusing on Postcolonial & Comparative Literatures\nAt least 1 course focusing on Race & Ethnicity\n1 300-level literature course may be taken in another department or program, subject to\napproval by the DUS\nStudents who matriculated Spring 2022 or earlier can follow requirements as outlined in a\nCatalog edition corresponding to their prior quarters of enrollment. The Ofﬁce of the\nRegistrar maintains an archive of Catalog editions.\n\nHonors in Literature\nTo prepare to apply to the honors program, all literature majors take ENGLISH 397-0\nResearch Seminar for Literature Majors, which provides an opportunity to complete a\n15-page research paper. Literature majors with strong academic records may then apply\nduring spring of junior year for admission to the 2-quarter senior thesis sequence\n(ENGLISH 398-1 & ENGLISH 398-2), which meets the following fall and winter quarters\n(ENGLISH 398-1 & ENGLISH 398-2 do not count toward the English major). Accepted\nstudents are expected to produce a senior thesis of about 40 pages. Students whose\ntheses and grades meet department criteria are recommended to the college for\ngraduation with honors. For more information, including funding opportunities, visit the"
    },
    {
        "Course Title": "The department website and see Honors in the Major",
        "Description": "\n"
    },
    {
        "Course Title": "The English Minor",
        "Description": "\nCourse List\nCourseTitle\nDepartment Courses (7 units)\n2 200-level Historical Breadth courses\n\n\n1 emphasizing works written before 1830\n1 emphasizing works written after 1830\n1 required seminar\nENGLISH 300-0\nSeminar in Reading and Interpretation\n4 additional literature courses\n1 course may be taken at the 200 level; all others must be taken at the 300 level\n2 emphasizing works written before 1830\n2 emphasizing works written after 1830\n1 300-level literature course may be taken in another department or program, subject to\napproval by the DUS\nStudents who matriculated Spring 2022 or earlier can follow requirements as outlined in a\nCatalog edition corresponding to their prior quarters of enrollment. The Ofﬁce of the\nRegistrar maintains an archive of Catalog editions.\n"
    },
    {
        "Course Title": "The Entrepreneurship Minor",
        "Description": "\nThe Farley Center's undergraduate minor in entrepreneurship is open to students from all\nundergraduate schools at Northwestern. It is designed for students who are interested in\npursuing a practical education in how to start a business or how to make innovation a\ncornerstone of their career paths.\n\nThe minor requires 8 courses, including 5 core courses and 3 electives. No more than 3\ncourses may be double counted between a student's major program and the minor.\nStudents with a primary major outside of McCormick may also be subject to the double\ncounting rules of their home schools. Courses with a grade lower than “C-” (C minus)\ncannot be applied to the minor. To declare the Entrepreneurship minor, students should\nsubmit the minor declaration form in MAS (McCormick Advising System) at least one year\nprior to their expected graduation date.\n\nPlease also note that many of our graduate level courses are open to undergraduate\nstudents. Refer to the Farley Center website for a complete listing of all courses and the\nmost up-to-date information on the minor program.\n\nCore courses:\nENTREP 225-0 Principles of Entrepreneurship\nENTREP 310-0 Personal Branding or ENTREP 331-0 Entrepreneurial Sales and Marketing\nENTREP 330-1 Startup Accounting and Finance\nENTREP 360-0 Leadership, Ethics, and You or ENTREP 365-0 Tech Ethics and Business\nIntegrity (open to students admitted to the Farley Bay Area Quarter only)\n\n\nAny Farley Center experiential course: includes all NUvention courses, ENTREP 325-0\nEngineering Entrepreneurship, ENTREP 340-0 Innovate for Impact, ENTREP 425-0\nConsulting for Wearable Technology, and ENTREP 490-0 Product Management\nElectives:\nAny Farley Center course\nThe following pre-approved coursework from other schools and programs on campus.\nAny outside coursework to be applied to the minor must be approved by the Farley\nCenter in advance and must be in compliance with double-counting rules. Students may\npetition courses not on this list in MAS. Please write to farley@northwestern.edu with\nquestions.\nBUS_INST 301 Accounting\nBUS_INST 302 Marketing Management\nBUS_INST 303 Leadership In Organizations\nBUS_INST 321 Business and Economic Institutions in Historical Perspective\nCOMM_ST 302 Law of The Creative Process\nCOMM_ST 363 Bargaining and Negotiation\nDSGN 305 Human-Centered Service Design\nDSGN 308 Human-Centered Product Design\nDSGN 350 Intellectual Property and Innovation\nDSGN 382 Service Design Studio I & II\nDSGN 384 Interdisciplinary Product Design Projects I & II\nIMC 303 Integrated Marketing Communications Strategy\nIMC 307 Digital, Social and Mobile Marketing\nIMC 310 Integrated Marketing and Communication Law, Policy and Ethics\nIMC 311 Data Governance: Critical Issues in Digital Marketing Communications\nJOUR 319 Entrepreneurial Approaches to Media Innovation\nLDRSHP 304 Leading from Design\nLOC 312 Modern Organization and Innovations\n"
    },
    {
        "Course Title": "The Environmental Engineering Degree",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nRequirements (48 units)\nCore Courses (27 units)1\nCourse List\nCourseTitle\n4 mathematics courses\n4 units of basic science:\n\n\nPHYSICS 135-2\n& PHYSICS 136-3\nGeneral Physics\nand General Physics Laboratory\nor PHYSICS 125-2\n& PHYSICS 126-2\nGeneral Physics for ISP\nand Physics Laboratory for ISP\nor PHYSICS 140-2\n& PHYSICS 136-2\nFundamentals of Physics\nand General Physics Laboratory\nCHEM 131-0\n& CHEM 132-0\n& CHEM 141-0\n& CHEM 142-0\nFundamentals of Chemistry I\nand Fundamentals of Chemistry II\nand Fundamentals of Chemistry Laboratory I\nand Fundamentals of Chemistry Laboratory II\nor CHEM 151-0\n& CHEM 152-0\n& CHEM 161-0\n& CHEM 162-0\nGeneral Chemistry I\nand General Chemistry II\nand General Chemistry Laboratory I\nand General Chemistry Laboratory II\nor CHEM 171-0\n& CHEM 172-0\n& CHEM 181-0\n& CHEM 182-0\nAdvanced General Inorganic Chemistry\nand Advanced General Physical Chemistry\nand Advanced General Inorganic Chemistry Laboratory\nand Advanced General Physical Chemistry Laboratory\n4 engineering analysis and computer proﬁciency courses\n3 design and communications courses\n7 social sciences/humanities courses\n\n\n5 unrestricted electives\nMajor Program (21 units)\nCourse List\nCourseTitle\n3 gateway courses\nCIV_ENV 201-0\nEngineering Possibilities: Decision Science in the Age of Smart Technologies\nCIV_ENV 202-0\nBiological and Ecological Principles\nCIV_ENV 203-0\nEarth in the Anthropocene\n5 basic engineering courses\nBMD_ENG 250-0\nThermodynamics\nor CHEM_ENG 211-0\nThermodynamics\nCIV_ENV 304-0\nCivil and Environmental Engineering Systems Analysis\nCIV_ENV 306-0\nUncertainty Analysis\nMAT_SCI 201-0\nIntroduction to Materials Science and Engineering Principles\nMECH_ENG 241-0\nFluid Mechanics I\n8 environmental engineering core courses\nCHEM 215-1\nOrganic Chemistry I\nCIV_ENV 260-0\nEnvironmental Systems and Processes\nCIV_ENV 340-0\nHydraulics and Hydrology\nCIV_ENV 361-1\nEnvironmental Microbiology\nCIV_ENV 346-0\nEcohydrology\nCIV_ENV 364-0\nSustainable Water Systems\nCIV_ENV 365-0\nEnvironmental Laboratory\n\n\nCIV_ENV 367-0\nChemical Processes in Aquatic Systems\n2 capstone design courses (0.5 units each)\nCIV_ENV 382-1\n& CIV_ENV 382-2\nCapstone Design I\nand Capstone Design II\n4 technical elective courses 2\n1 professional development course (0.34 units) 3\nCIV_ENV 301-1\nProfessional Development Seminar I\n1\nSee general requirements for details.\n\n2\nFrom an approved list (available in Undergraduate CIV_ENV Handbook) in engineering,\nmathematics, or science; at least 3 units must be 100% engineering topic; may include\nonly 1 unit of CIV_ENV 399-0 Projects; no 399 course from another department is\naccepted; no course may be taken P/N.\n\n3\n0.34 units may count toward unrestricted electives.\n"
    },
    {
        "Course Title": "The Environmental Engineering Minor",
        "Description": "\nThe minor in environmental engineering provides students with a sampling of\nfoundational courses in addition to two electives focusing on environmental chemistry,\nmicrobiology, or transport processes.\n\nCourse List\nCourseTitle\nRequirements (8 units)\nCore Courses (6 units)\nCIV_ENV 201-0\nEngineering Possibilities: Decision Science in the Age of Smart Technologies\nCIV_ENV 202-0\nBiological and Ecological Principles\nCIV_ENV 203-0\nEarth in the Anthropocene\n\n\nCIV_ENV 260-0\nEnvironmental Systems and Processes\nCIV_ENV 346-0\nEcohydrology\nCIV_ENV 364-0\nSustainable Water Systems\nElectives (2 units): choose 2 courses from below\nCIV_ENV 340-0\nHydraulics and Hydrology\nCIV_ENV 361-1\nEnvironmental Microbiology\nCIV_ENV 361-2\nPublic & Environmental Health\nCIV_ENV 367-0\nChemical Processes in Aquatic Systems\nCIV_ENV 368-0\nSustainability: The City\nCIV_ENV 370-0\nEmerging Organic Contaminants\nCIV_ENV 398-1\nCommunity-based Design 1\nCIV_ENV 398-2\nCommunity-based Design 2\nCIV_ENV 399-0\nProjects 1\n400-level course by permission\n1\nOnly 1 CIV_ENV 399-0 Projects unit may be counted toward the minor.\n\nAdditional Conditions for this minor\n\nNo more than 4 minor courses may be used to fulﬁll requirements in the student's major\nprogram.\nA grade of at least C– is required in each course for the minor.\nStudents should discuss with the minor coordinator how best to satisfy prerequisites for\nrequired courses.\nTo declare the Environmental Engineering minor, students should submit the minor\ndeclaration form in MAS (McCormick Advising System) no later than the end of their\njunior year.\n\n"
    },
    {
        "Course Title": "The Environmental Policy and Culture Adjunct Major",
        "Description": "\nThe adjunct major in Environmental Policy and Culture provides an intellectual home for\nthose students interested in studying environmental questions from the perspective of\nthe social sciences and humanities.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nEPC adjunct major requirements (11 units)\n4 Core Courses\n1 Ethics Course\n1 Methods Course\n2 Natural Science courses, both selected from one of the following four categories (or\nalternative pair approved by the DUS):\nDiversity and Evolution\nEcology and Conservation\nEarth Systems and Planetary Change\nSustainability\nField Experience requirement (may or may not have an academic credit component)\n3 Elective Course units (any combination from the Electives list, additional Core Courses,\nadditional Ethics Courses, or academic credit associated with the Field Experience\nrequirement)\nLists of courses that fulﬁll described requirements can be found below. Check website for\nquarterly updates about additional options.\n\nEXPAND ALL\nCore Course List (students in the EPC adjunct major choose 4):\nElective Course List (students in the EPC adjunct major complete a total of 3 elective\nunits):\nEthics Course List (students in the EPC adjunct major choose 1):\nMethods Course List (students in the EPC adjunct major choose 1):\nNatural Science Course Lists (students in the EPC adjunct major choose 2 from one of the\nfollowing lists):\n\n\nField Experience for the EPC adjunct major - projects as approved by the program.\nExamples listed here.\n"
    },
    {
        "Course Title": "The Environmental Policy and Culture Minor",
        "Description": "\nStudents doing the minor in environmental policy and culture may choose to concentrate\nin the humanities or social sciences or to take courses in both areas. Lists of Core, Natural\nScience, and Elective Courses can be found in the section of this Catalog describing the\nEPC adjunct major. A quarterly list of additional courses counting toward the minor is\navailable from the program ofﬁce and the EPC website. Course exceptions must be\napproved by the program director.\n\nEPC minor requirements (7 units)\n3 Core Courses (for a course list see EPC major)\n1 Natural Science course (students may choose any one course from the natural science\nlists for the EPC major)\n3 Elective Courses\nElectives may include no more than 1 quarter of Independent Study (ENVR_POL 399-0)\nElectives may include additional Core Courses beyond the three required\nElectives may include courses from the Elective list or Ethics list for the EPC major\nElectives may include an additional Natural Science course, but no more than two of the\ncourses for the minor may be from the natural sciences\nAt least 4 of the 7 units must be at the 300-level.\n"
    },
    {
        "Course Title": "The Environmental Sciences Major",
        "Description": "\nThe major in Environmental Sciences has two tracks: one in science (Science Track) and\none in economic policy (Policy Track). The tracks share foundation courses in science and\nmath, and the core curriculum. Advanced coursework differs by track.\n\nStudents plan their academic paths with an environmental sciences adviser. Many\nfoundation courses are prerequisites for advanced courses and should be completed as\nsoon as possible. Students envisioning graduate training in Environmental Sciences are\nspeciﬁcally encouraged to take additional math and the full sequence of either General\nPhysics or 200 level Biological Sciences. Students interested in environmental health and\nmedical professions are advised to take the full 200-level sequence in biological sciences\nand two additional quarters of organic chemistry.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nMajor Requirements: Program Courses (11 units)\n3 Core Environmental Science Courses at the 200-Level\nCourse List\nCourseTitle\nENVR_SCI 201-0\nEarth: A Habitable Planet\nENVR_SCI 202-0\nThe Health of the Biosphere\nENVR_SCI 203-0\nHumans and the Environment\n8 Advanced Studies Courses\nAdvanced studies courses differ by the chosen track. In both the science track and the\npolicy track at least 6 of the required 8 advanced studies courses must be at the 300-level.\nSee the Advanced Studies Course Lists below for lists of approved courses. See the\nEnvironmental Sciences webpage for updates to these lists. Students who double-major in\neconomics and environmental sciences are encouraged to do the science track in\nenvironmental sciences, and must take extra 300-level economics classes to fulﬁll the\nrequirements for both majors.\n\nScience Track Advanced Studies Course Requirements\n6 courses from the Science List. Up to 2 of these may be replaced with ENVR_SCI 399-0\nresearch courses.\n2 courses from the Environment and Society List.\nPolicy Track Advanced Studies Course Requirements\n4 courses from the Science List.\n2 required economics courses: ECON 281-0 and ECON 310-1.\n1 additional economics course chosen from: ECON 371-0, ECON 372-0, or ECON 373-0.\n1 course selected from either the Science List or the Environment and Society List.\nMajor Requirements: Foundations in Science and Math (9.68-12.38 units)\nRequired Math and Chemistry Courses\nStudents should complete all of the following math and chemistry courses in their ﬁrst\ntwo years. Total units depend on math sequence taken. Courses may double-count with\nanother major or minor.\n\n\nFundamentals of Chemistry I\n\nSingle-Variable Calculus with Precalculus\n\nSingle-Variable Calculus with Precalculus\n\nCourse List\nCourseTitle\nMATH 220-1 Single-Variable Differential Calculus\nor MATH 218-1\n& MATH 218-2\nand Single-Variable Calculus with Precalculus\nMATH 220-2 Single-Variable Integral Calculus\nor MATH 218-3\nCHEM 131-0\n& CHEM 141-0\n& CHEM 132-0\n& CHEM 142-0\nand Fundamentals of Chemistry Laboratory I\nand Fundamentals of Chemistry II\nand Fundamentals of Chemistry Laboratory II (Pre-requisite: CHEM 110-0)\nor CHEM 151-0\n& CHEM 161-0\n& CHEM 152-0\n& CHEM 162-0\nand General Chemistry Laboratory I\nand General Chemistry II\nand General Chemistry Laboratory II\nor CHEM 171-0\n& CHEM 181-0\n& CHEM 172-0\n& CHEM 182-0\nand Advanced General Inorganic Chemistry Laboratory\nand Advanced General Physical Chemistry\nand Advanced General Physical Chemistry Laboratory\n5 Additional Related Math and Science Courses\nStudents must take 5 courses (and their associated lab, if applicable) from the following\noptions, with at least 2 from the same group. Required labs do not count toward the\n5-course total.\n\nAdvanced General Inorganic Chemistry\n\nGeneral Chemistry I\n\nCourse List\nCourseTitle\nBIOL_SCI 201-0\nBIOL_SCI 202-0\n\nMolecular Biology\n\n\nOrganic Chemistry I\n\nOrganic Chemistry II\n\nEngineering Analysis I\n\n& BIOL_SCI 232-0 Cell Biology\nand Molecular and Cellular Processes Laboratory\nBIOL_SCI 203-0\n& BIOL_SCI 233-0 Genetics and Evolution\nand Genetics and Molecular Processes Laboratory\nCHEM 215-1\n& CHEM 235-1\nand Organic Chemistry Lab I\nCHEM 215-2\n& CHEM 235-2\nand Organic Chemistry Lab II\nECON 201-0 Introduction to Macroeconomics\nECON 202-0 Introduction to Microeconomics\nGEN_ENG 205-1\nMATH 230-1 Multivariable Differential Calculus\nMATH 240-0 Linear Algebra (Pre-requisite: MATH 230-1)\nMATH 250-0 Elementary Differential Equations (Pre-requisites: MATH 226-0, MATH\n230-2 and MATH 240-0)\nPHYSICS 135-1\n& PHYSICS 136-1 General Physics\nand General Physics Laboratory\nPHYSICS 135-2\n& PHYSICS 136-2 General Physics\nand General Physics Laboratory\nPHYSICS 135-3\n& PHYSICS 136-3 General Physics\nand General Physics Laboratory\nSTAT 202-0 Introduction to Statistics and Data Science\nor STAT 210-0\nAdvanced Studies Course Lists\nApproved courses for the advanced studies course requirements may be selected from\nthe below Science List and Environment and Society List, dependent on track\nrequirements outlined above. Check program webpage for dynamic list of pre-approved\ncourses.\n\nIntroduction to Probability and Statistics\n\nEXPAND ALL\nScience List\nEnvironment and Society List\nHonors in Environmental Sciences\n\n\nStudents with strong academic records and an interest in pursuing honors should\napproach a faculty member by the end of junior year to discuss possible projects; these\nmay involve ﬁeld, experimental, or computational research. Research is completed during\na minimum 2 quarters of ENVR_SCI 399-0 Independent Study with their faculty research\nmentor, which may count toward major requirements. Students then prepare a written\nthesis. Those whose theses and grades meet program criteria are recommended to the\ncollege by their faculty mentor for graduation with honors. For more information consult"
    },
    {
        "Course Title": "The the program director and see Honors in the Major",
        "Description": "\n"
    },
    {
        "Course Title": "The Film and Media Studies Minor",
        "Description": "\nhttps://communication.northwestern.edu/academics/radio-television-ﬁlm/undergraduate\n-programs/minor-ﬁlm-media-studies.html\n\nThe Film and Media Studies Program brings together faculty and students from across the\nUniversity who are interested in thinking about ﬁlm and media within a broad intellectual\nframework. Students in this interdisciplinary program acquire critical tools for analyzing\ntraditional and new media, as well as knowledge of some crucial historical and interpretive\nproblems raised by the study of media within the context of the humanities and social\nsciences. Students who minor in ﬁlm and media studies are encouraged to participate in\nthe rich and varied media offerings of the University, including ﬁlm series and individual\nﬁlm screenings, workshops, performances, exhibitions, and presentations by invited\nspeakers. Students must formally apply to minor in ﬁlm and media studies in the School of\nCommunication’s Department of Radio/Television/Film.\n\nThe minor is open to all Northwestern undergraduates except Radio/Television/Film\nmajors.\n\nMinor Requirements (6 units)\nAll courses for SoC majors, minors, ﬁelds of concentration and distribution requirements\nmust be completed with a grade of C- or higher and may not be taken P/N.\n\nA maximum of the equivalent of 2 non-Northwestern academic units can count towards\nan SoC minor.\n\nRTVF 220-0 Analyzing Media Texts\n5 additional units of credit with a primary emphasis on ﬁlm and/or media studies, chosen\nfrom the following and including at least 3 at the 300 level.\nCourse List\n\n\nCourseTitle\nRTVF 298-0 Studies in Media Topics\nRTVF 310-0 Television History\nRTVF 312-1 History of Film I\nRTVF 312-2 History of Film II\nRTVF 313-1 Doc Film History & Criticism\nRTVF 313-2 Documentary Film & Video\nRTVF 314-0 History of the Recording Industry\nRTVF 315-0 Audio Drama\nRTVF 316-0 Media and Cultural Theory\nRTVF 321-0 Radio/Tv/Film Authorship\nRTVF 322-0 Radio/Television/Film Genre\nRTVF 325-0 Film, Media & Gender\nRTVF 326-0 Film & TV Criticism\nRTVF 330-0 Culture Industries\nRTVF 341-0 Technological Innovations\nRTVF 345-0 History of Hollywood Cinema\nRTVF 351-0 National Cinema\nRTVF 353-0 Film, Media, and Globalization\nRTVF 398-0 Symposium: Issues in RTVF\nCOMM_ST 270-0 Media Effects\nCOMM_ST 274-0\nCOMM_ST 275-0\nASIAN_LC 224-0\nCLASSICS 245-0\nCOMP_LIT 305-0\nENGLISH 214-0\nENGLISH 386-0\nFRENCH 375-0\nGERMAN 228-0\nITALIAN 251-0\nITALIAN 351-0\nRELIGION 371-0\nSLAVIC 267-0\nSLAVIC 367-1\nThe following are topics courses and may only count with advisor approval when the\nprimary emphasis of the course is ﬁlm or media studies.\n\nPower in Entertainment\nPersuasive Images: Rhetoric of Popular Culture\nIntroduction to Japanese Film, Media, and Visual Culture\nClassics and the Cinema\nStudies in Film, Media, and Visual Culture\nIntroduction to Film and Its Literatures\nStudies in Literature and Film\nFrench Film\nGerman Film\nIntroduction to Italian Cinema\nItalian Film and Transnational Cinema\nReligion and Film\nCzech Culture: Film, Visual Arts & Music\nRussian Film\n\nCourse List\n\n\nCourseTitle\nART_HIST 390-0\nCOMP_LIT 383-0\nFRENCH 390-0\nSPANISH 397-0\nCultures (Taught in English)\nOther courses also may be counted toward the minor with the approval of a ﬁlm and\nmedia studies advisor.\n\nUndergraduate Seminar\nSpecial Topics in Theory: Critical Theory\nTopics in Literature and Culture\nTopics in Latin American, Latina & Latino, and Iberian Literatures and\n"
    },
    {
        "Course Title": "The French Major",
        "Description": "\nThe major in French provides rigorous interdisciplinary training in the French language\nand the literary, cultural, and intellectual traditions of France and the French- speaking\nworld.\n\nExtensive coursework at all levels of language study prepares students to engage critically\nwith a rich array of texts, images, and ideas from francophone cultures. Ranging in scope\nfrom the medieval period to the present, course content extends across regions and\nincorporates many genres, media, and historical documents, placing them in their social\nand political contexts. Majors acquire the tools for literary and cultural analysis, learn\nabout the distinctive contributions of French critical thought, and complete an\nindependent research paper. Students are thus prepared to be linguistically adept, global\ncitizens who are attuned to the complexities of language and culture.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nPrerequisite\nFRENCH 201-0\nMajor Requirements (14 units)\nAt most 5 200-level courses taught in French, including:\nFRENCH 202-0\nFRENCH 210-0\n\nCulture and Society (or equivalent proﬁciency)\n\nWriting Workshop: Cultural Encounters in Contemporary France\nReading Literatures in French\n\n\nor FRENCH 211-0 Reading Cultures in French\nAt least 1 but at most 2 of:\nFRENCH 271-0\nIntroducing the Novel\nFRENCH 272-0\nIntroducing Theatre\nFRENCH 273-0\nIntroducing Poetry\nAt least 9 courses must be at the 300 level, including:\nAt least 1 advanced language course chosen from:\nFRENCH 300-0\nFrench Phonetics\nFRENCH 301-0\nAdvanced Language in Context: Society and Popular Culture\nFRENCH 302-0\nAdvanced Writing: Finding Your Voice in French\nFRENCH 303-0\nAdvanced Conversation: Debating Contemporary France\nFRENCH 309-0\nFrench For Professions\nFRENCH 391-0\nTheory and Practice of Translation\nFRENCH 393-0\nForeign Language Teaching: Theory and Practice\nAt least 4 literature and culture courses selected from FRENCH 310 through FRENCH\n390. At least 2 must cover the period prior to 1800.\n1 senior seminar:\nFRENCH 395-0\nAdvanced Studies in Culture and Thought\nAt most 2 300-level courses taught in English may be counted toward the major. Of these,\n1 may be a course with at least 50 percent French content offered outside the\ndepartment; the course will count as an elective.\nCourses with the requisite French content include: 1\nART_HIST 350-1\n& ART_HIST 350-2\n19th Century Art 1: 1789–1848\nand 19th Century Art 2: 1848–1914\nHISTORY 341-0\nParis: World City, 1700 to the Present\n\n\nHISTORY 342-1\n& HISTORY 342-2\nThe French Revolution and Napoleon\nand History of Modern France: 19th c. to present\nPHIL 315-0\nStudies in French Philosophy\nNo more than 1 399 may count toward the major unless the student is completing an\nhonors thesis.\nAt least 2 300-level courses must be completed at Northwestern.\n1\nOther courses may be approved at the discretion of the director of undergraduate studies.\n\nExceptions and Waivers\nMajors who begin French studies in FRENCH 111-1 Elementary French, FRENCH 115-1\nIntensive Elementary French, or  FRENCH 121-1 Intermediate French may count FRENCH\n201-0 Culture and Society as 1 elective course at the 200 level.\nMajors with an AP score of 5 or with departmental advanced placement, depending upon\nresults of the French Language Placement Test, may either waive FRENCH 202-0 Writing\nWorkshop: Cultural Encounters in Contemporary France or waive 1 elective course at the\n200-level. In this case total course requirements for the major will be 13 courses, with a\nmaximum of 4 200-level courses and at least 9 300-level courses.\nHonors in French\nMajors with strong academic records and an interest in pursuing honors should contact\nthe director of undergraduate studies no later than spring quarter of junior year. The\nhonors thesis is produced through 2 quarters of FRENCH 399-0 Independent Study;\nthese FRENCH 399-0 enrollments will count toward the 14 required units for the major.\nThe thesis may build on previous work done in a 300-level course.\n\nStudents whose theses and grades meet department criteria are recommended to the\ncollege for graduation with honors. For more information see the department website or"
    },
    {
        "Course Title": "The consult with the director of undergraduate studies and see Honors in the Major",
        "Description": "\n\nCourses\nEXPAND ALL\nIntroductory and Intermediate Language Courses\nIntroductory Literature and Culture Courses\nCourses with Readings and Discussion in English\nCourses with Prerequisites in French\n\n"
    },
    {
        "Course Title": "The French Minor",
        "Description": "\nThe goal of the minor in French is to give students a solid grounding and good ﬂuency in\nthe French language and to provide a basic familiarity with important aspects of French\nculture and society, enabling them to pursue their interests in French and in countries\nwhere French is used.\n\nThe minor is designed for students who have a strong interest in French but cannot fulﬁll\nthe requirements of the French major.\n\nCulture and Society (or equivalent proﬁciency)\n\nWriting Workshop: Cultural Encounters in Contemporary France\n\nCourse List\nCourseTitle\nPrerequisite\nFRENCH 201-0\nMinor Requirements (8 units)\nAt least 2 courses in language, including:\nFRENCH 202-0\n1 advanced language course chosen from:\nFRENCH 300-0\nFrench Phonetics\nFRENCH 301-0\nAdvanced Language in Context: Society and Popular Culture\nFRENCH 302-0\nAdvanced Writing: Finding Your Voice in French\nFRENCH 303-0\nAdvanced Conversation: Debating Contemporary France\nFRENCH 309-0\nFrench For Professions\nFRENCH 391-0\nTheory and Practice of Translation\nFRENCH 393-0\nForeign Language Teaching: Theory and Practice\nAt least 3 courses in literature and culture, including:\nFRENCH 210-0\nReading Literatures in French\nor FRENCH 211-0\nReading Cultures in French\nFRENCH 271-0\n\n\nIntroducing the Novel\nor FRENCH 272-0\nIntroducing Theatre\nor FRENCH 273-0\nIntroducing Poetry\n1 course selected from 310-367 or 380-390.\n1 additional course in literature and culture selected from 310 through 390, or 1 of the\nlanguage courses 309 or 391 that is not being applied toward the advanced-language\ncourse requirement\n2 elective courses in language or literature and culture at the 200 or 300 level\nNo more than 1 300-level French department course offered in English may be counted\ntoward the minor. Courses in English at the 200 level may not count toward the minor.\nAt least 2 courses must be completed at Northwestern.\nExceptions and Waivers\nMinors who begin French studies in FRENCH 111-1 Elementary French, FRENCH 115-1\nIntensive Elementary French, or  FRENCH 121-1 Intermediate French may count FRENCH\n201-0 Culture and Society as 1 of the 2 elective courses in language or literature and\nculture in French.\nMinors with an AP score of 5 or with departmental advanced placement, depending upon\nresults of the French Language Placement Test, may either waive FRENCH 202-0 Writing\nWorkshop: Cultural Encounters in Contemporary France or waive 1 elective course at the\n200-level. In this case total course requirements for the minor will be 7 courses.\n"
    },
    {
        "Course Title": "The Gender and Sexuality Studies Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nProgram Courses (11 units)\n2 Core Courses:\nGNDR_ST 220-0\nSexual Subjects: Introduction to Sexuality Studies\nGNDR_ST 230-0\n\n\nTraditions in Feminist Thought\n2 Theory Courses:\nGNDR_ST 381-0\nQueer Theory\nGNDR_ST 397-0\nFeminist Theory\nor GNDR_ST 380-0\nBlack Feminist Theory\n2 Research Courses:\nGNDR_ST 350-3\nResearch Seminar in Gender & Sexuality Studies\nor GNDR_ST 350-4\nResearch Seminar in Gender & Sexuality Studies\nor GNDR_ST 350-6\nResearch Seminar in Gender & Sexuality Studies\nGNDR_ST 396-0\nSenior Capstone Seminar\nor GNDR_ST 398-0\nSenior Research Seminar\n5 Additional Courses, including:\nAt least 3 at the 300 level\nAt least 1 with a historical focus 1\nAt least 1 with a transnational focus 2\nRelated Courses (4 units)\nAt least 2 at the 300 level\nGender & Sexuality Studies courses (including co- or cross-listed) may be counted. Other\ncourses that focus on gender and/or sexuality but are not co- or cross-listed may be\napproved by the Director of Undergraduate Studies.\n1\nHistorical focus courses may include (but are not limited to): GNDR_ST 233-0 Gender,\nPolitics, and Philosophy, GNDR_ST 321-0 Gender, Sexuality, and History, GNDR_ST 324-0\nUS Gay and Lesbian History.\n\n2\nTransnational courses may include (but are not limited to): GNDR_ST 341-0 Transnational\nPerspectives on Gender and Sexuality, GNDR_ST 353-0 Gender and Citizenship,\nGNDR_ST 363-0 Postcolonial Studies and Gender and Sexuality.\n\nHonors in Gender and Sexuality Studies\n\n\nMajors with strong academic records and an interest in pursuing honors should contact\nthe honors coordinator (typically the Director of Undergraduate Studies) in their junior\nyear and identify a faculty member who will serve as thesis adviser. Students whose\ntheses and grades meet program criteria are recommended to the college for graduation\nwith honors. For more information, consult the Director of Undergraduate Studies and\nsee Honors in the Major.\n"
    },
    {
        "Course Title": "The Gender and Sexuality Studies Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (7 units)\n2 Core Courses:\nGNDR_ST 220-0\nSexual Subjects: Introduction to Sexuality Studies\nGNDR_ST 230-0\nTraditions in Feminist Thought\n5 Additional Courses:\nAt least 2 at the 300 level.\nAt least 1 must represent a humanities-based approach to gender and sexuality studies. 1\nAt least 1 must represent a social science–based approach to gender and sexuality\nstudies. 2\nAll courses must be from gender and sexuality studies (including co- or cross-listed\ncourses).\n1\nHumanities-based courses may include (but are not limited to): GNDR_ST 231-0 Gender,\nSexuality, and Representation, GNDR_ST 233-0 Gender, Politics, and Philosophy,\nGNDR_ST 321-0 Gender, Sexuality, and History, GNDR_ST 324-0 US Gay and Lesbian\nHistory, GNDR_ST 361-0 Gender, Sexuality, and Literature.\n\n2\nSocial Science-based courses may include (but are not limited to): GNDR_ST 232-0\nSexuality & Society, GNDR_ST 331-0 Sociology of Gender and Sexuality, GNDR_ST 351-0\nGender, Sexuality, and Public Policy, GNDR_ST 353-0 Gender and Citizenship.\n"
    },
    {
        "Course Title": "The German Major",
        "Description": "\nCourses for the German major are designed to provide advanced ﬂuency in the language\nas well as knowledge of modern German/central European history and culture as well as\nthe basic canon of modern (post-1800) German literature. In addition, courses in a\n\n\nconcentration, chosen with the adviser, allow students to focus on a particular interest or\nsubject.\n\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nPrerequisite\nGERMAN 102-3 Intermediate German or equivalent proﬁciency.\nDepartment Courses (12 units)\n8 core courses, from list posted on the department website\n4 German-language courses in language and culture\n2 at the 200 level\n2 at the 300 level\n4 German-language courses in literature, culture, history, and politics\n2 at the 200 level\n2 at the 300 level\n4 courses in an individual concentration; must be approved by the adviser\nAt most 2 taught in English\nAt most 3 in a complementary language, such as Yiddish, Turkish, or Czech\nMay be offered by other departments or programs (Please check with the Director of\nUndergraduate Studies ﬁrst)\nMajors returning from a study abroad program must enroll in at least one (1) 300-level\nGerman-language course in the department.\nRelated Courses (2 units)\nChosen from history, philosophy, religion, or other relevant areas\nMust be approved by the adviser and complement the concentration\nHonors in German\nMajors with strong academic records and an interest in pursuing honors should contact\nthe honors advisor in spring of junior year. They may qualify for departmental honors by\ncompleting 2 quarters of GERMAN 398-0 Undergraduate Seminar or GERMAN 399-0\nIndependent Study; 2 quarters of 400-level courses; or 1 quarter of GERMAN 398-0 or\nGERMAN 399-0 and 1 quarter of a 400-level course. These courses may count toward the\nmajor. Students must present a research paper at the end of their second quarter of\nhonors study.\n\n\nStudents whose research paper and grades meet department criteria are recommended\nto the college for graduation with honors. For more information consult the director of\nundergraduate studies and see Honors in the Major.\n\nThe Department of German offers minors in German, German studies, and Business\nGerman. Each minor consists of 8 courses. The minors are designed to help students\ndevelop a coherent set of courses in accordance with their own interests in German\nlanguage, literature, thought, culture, politics, and business practices.\n\nMinor Requirements (8 units)\nPrerequisite: GERMAN 102-3 Intermediate German or equivalent proﬁciency\n3 German-language courses in language and media, from list posted on the department\nwebsite\n2 at the 200 level\n1 at the 300 level\n3 German-language courses in literature and culture, from list posted on the department\nwebsite\n2 at the 200 level\n1 at the 300 level\n2 courses making up an individual concentration developed with the undergraduate\nadviser; may be taught in English\nMinors returning from a study abroad program must enroll in at least 1 300-level\nGerman-language course in the department.\n"
    },
    {
        "Course Title": "The German Studies Minor",
        "Description": "\nThe Department of German offers minors in German, German studies, and Business\nGerman. Each minor consists of 8 courses. The minors are designed to help students\ndevelop a coherent set of courses in accordance with their own interests in German\nlanguage, literature, thought, culture, politics, and business practices.\n\nPrerequisite: GERMAN 102-3 Intermediate German or equivalent proﬁciency\n2 German-language courses in language, literature, and culture, from list posted on the\ndepartment website\n6 courses making up an individual concentration developed with the undergraduate\nadviser. Relevant courses are offered in such diverse areas as history, political science,\nphilosophy, sociology, and economics.\n\n"
    },
    {
        "Course Title": "The Global Health Studies Adjunct Major",
        "Description": "\nStudents must also complete the Undergraduate Registration Requirement and the\ndegree requirements of their home school.\n\nNOTE: This Catalog describes Weinberg College BA requirements that pertain to\nstudents who matriculated at Northwestern after spring quarter 2023. Refer to the\nArchives if you are following BA requirements described in the 2018-2019 through\n2022-2023 editions.\n\nCourse List\nCourseTitle\nAdjunct Major Requirements (11 units)\n4 core courses:\nGBL_HLTH 201-0\nIntroduction to Global Health 1\nGBL_HLTH 302-0\nGlobal Bioethics\nGBL_HLTH 309-0\nBiomedicine and World History 2\nor GBL_HLTH 222-0\nThe Social Determinants of Health\nor GBL_HLTH 325-0\nHistory of Reproductive Health\nchoice of one methods core course (one of these two, or see footnote): 3\nGBL_HLTH 320-0\nQualitative Research Methods in Global Health\nor GBL_HLTH 318-0\nCommunity-based Participatory Research Course\n3 additional GBL_HLTH courses 4\n4 elective courses. Elective credits can be fulﬁlled by pre-approved health-related courses\nfrom various departments, as listed on the GHS major page and program website. Courses\ntaken abroad can be counted as electives provided they are NU or NU-afﬁliated study\nabroad programs and the courses have been pre-approved for GHS elective credit. Study\nabroad courses taken that are not NU afﬁliated need prior approval from the DUS.\n1\nGBL_HLTH 301-0 (Introduction to International Public Health) from Spring 2022 or\nearlier may be applied in lieu of GBL_HLTH 201-0.\n\n2\n\n\nGBL_HLTH 322-0 (The Social Determinants of Health) from Spring 2022 or earlier may be\napplied in lieu of GBL_HLTH 222-0, GBL_HLTH 309-0, or GBL_HLTH 325-0.\n\n3\nThe methods course requirement can be fulﬁlled by GBL_HLTH 390-0 when offered as\none of the following topics: (Re)Mixing Qualitative Methods, or Quantiatitve Methods:\nTurning numbers into a Story. If Community Based Participatory Research was taken prior\nto Spring 2023 as a topic under GBL_HLTH 390-0 rather than GBL_HLTH 318-0, that may\nalso be applied.\n\n4\nGBL_HLTH 399-0 Independent Study and courses taken abroad may not be counted\ntoward this requirement.\n\nNote:\nStudents may elect to study abroad as part of their Global Health Studies curriculum.\nAll adjunct majors require completion of a stand-alone major as well.\nApproved elective courses (students may take courses from more than one subject area)\nEXPAND ALL\nAnthropology\nBiological Sciences\nChemistry\nCommunications\nEconomics\nEngineering\nEnglish\nField Studies\nGender Studies\nHistory\nInternational Studies\nPhilosophy\nPolitical Science\nPsychology\nPublic Health\nSESP\nSociology\nSpanish\nStatistics\nAdditional info\n\n\nDepending on the topic, other occasional courses may also be used as electives including,\nBLK_ST 380-0, AMER_ST 310-0, ANTHRO 390-0, ASIAN_AM 303-0, ASIAN_AM 380-0,\nBUS_INST 394-LK, COMM_ST 395-0, ENVR_SCI 390-0, GNDR_ST 390-0, HISTORY\n300-0 , HUM 370-5, INTL_ST 390-0, INTL_ST 395-0, JWSH_ST 390-0, LATINO 392-0,\nNEUROSCI 390-0, PHIL 361-0 and SOC_POL 351-0. For more details and an up-to-date\nlisting of courses, consult the Global Health Studies website or email the program.\n"
    },
    {
        "Course Title": "The Global Health Studies Minor",
        "Description": "\nCourse List\nCourseTitle\nMinor Requirements (7 units)\n2 core courses\nAll students complete:\nGBL_HLTH 201-0\nIntroduction to Global Health 1\nPlus one of the following: 2\nGBL_HLTH 302-0\nGlobal Bioethics\nor GBL_HLTH 320-0\nQualitative Research Methods in Global Health\nor GBL_HLTH 318-0\nCommunity-based Participatory Research Course\n2 additional GBL_HLTH courses 3\n3 elective courses. Elective credits can be fulﬁlled by pre-approved health-related courses\nfrom various departments, as listed on the GHS major page and program website. Courses\ntaken abroad can be counted as electives provided they are NU or NU-afﬁliated study\nabroad programs and the courses have been pre-approved for GHS elective credit. Study\nabroad courses taken that are not NU afﬁliated need prior approval from the DUS.\n1\nGBL_HLTH 301-0 (Introduction to International Public Health) from Spring 2022 or\nearlier may be applied in lieu of GBL_HLTH 201-0.\n\n2\nGBL_HLTH 390-0 may be used in substitution when the topic is either (Re)Mixing\nQualitative Methods, or Quantitative Methods: Turning Numbers into a Story. If\nCommunity Based Participatory Research was completed as a topic under GBL_HLTH\n390-0 prior to Spring 2023, rather than as GBL_HLTH 318-0, that may also be applied.\n\n3\n\n\nGBL_HLTH 399-0 Independent Study and courses taken abroad may not be counted\ntoward this requirement.\n\nNote:\nStudents may elect to study abroad as part of their Global Health Studies curriculum."
    },
    {
        "Course Title": "The A list of eligible elective courses can be found on the Global Health Adjunct Major",
        "Description": "\nthis Catalog. Refer also to the Global Health Studies website for updates and occasional\nofferings.\n\n"
    }
]